[{"reviewerID": "A3UC3YT2E65LZO", "asin": "B000052YJM", "reviewerName": "R. Dowling", "helpful": [2, 3], "reviewText": "I am a male and I have adult acne.  The acne meds dry out my skin.  I needed a moisturizer that wouldn't make my acne worse, and preferably, would help prevent acne.  This product fits the bill.  It is light, cooling, and doesn't clog my pores.  It's gentle enough that I can put it on my face right after shaving, and it doesn't sting or burn.  (It actually works really well as an after-shave conditioner; seems to help prevent red bumps and ingrown hairs!)  The only way this product could be better would be if they added sun protection to it.  I hope someday they make a version of this with SPF 15; if they do, I will give it 5 stars.", "overall": 4.0, "summary": "soothing oil-free moisture", "unixReviewTime": 1119484800, "reviewTime": "06 23, 2005"},
{"reviewerID": "ACXCS6NRA4EVU", "asin": "B000052YKI", "reviewerName": "Seattle girl", "helpful": [1, 2], "reviewText": "This lotion is the best that I've tried. It's lightweight, yet does the job of keeping my skin looking fresh and hydrated. I also love the fact that it has sun block in it. I use it in the morning and at night, and find that it works really well for me. It's a great product.", "overall": 5.0, "summary": "Great Lotion!", "unixReviewTime": 1133913600, "reviewTime": "12 7, 2005"},
{"reviewerID": "A3UC3YT2E65LZO", "asin": "B000052YKY", "reviewerName": "R. Dowling", "helpful": [6, 7], "reviewText": "The description says they use a non-soap forumlation, but look at the list of ingredients: one of the first ingredients is sodium tallowate -- which is basically a fancy name for soap!", "overall": 3.0, "summary": "\"non-soap\" formula?", "unixReviewTime": 1119139200, "reviewTime": "06 19, 2005"},
{"reviewerID": "AVYEYDC974DMD", "asin": "B000052YM7", "reviewerName": "M. Barth \"MTB\"", "helpful": [16, 23], "reviewText": "I recently purchased this from a local store, I have to admit I only bought it because it was reduced price.  But I have be using it twice a day for two weeks and the difference in my skin is very apparent.  I am a black 46 yr. old, since using this my skin glows, my cheeks are naturally rosy, my skin tone is evening out and my pores look better.  And my skin is so soft like a baby's.  I will be definitely be using this for quite some time, and the amount you get 6oz. is quite a lot of product.  In addition to my face and neck, I have be using it on hands and they are smoother and less wrinkled.  I wish I could bath in this stuff.  I would highly recommend it and there was little to no smell from the product.", "overall": 5.0, "summary": "Fantastic Product", "unixReviewTime": 1126483200, "reviewTime": "09 12, 2005"},
{"reviewerID": "A1BHCE2409B5QF", "asin": "B000052YMS", "reviewerName": "Victoria", "helpful": [3, 3], "reviewText": "My skin is very sensitive and very dry so i have to be very careful about what products i use. This lotion is definately a godsend. Since it doesn't have a sunscreen i only use it at night but it mosturizes really well and doesn't cause any breakouts. However, I think if you have oily or combination skin this may not work for you.", "overall": 5.0, "summary": "A must have for anyone with dry skin", "unixReviewTime": 1122422400, "reviewTime": "07 27, 2005"},
{"reviewerID": "A2W10YRC8CWAD7", "asin": "B000052YMT", "reviewerName": "Amazon Customer \"the undersigned\"", "helpful": [5, 5], "reviewText": "Cetaphil Gentle Skin Cleanser is the gentlest facial cleanser I have been able to find.  I am highly allergic to several different soaps and preservatives, but Cetaphil doesn't cause me to break out, itch, or dry up.I'd suggest the liquid Cetaphil cleanser instead of their soap bar, as bars can cause one to have clogged pours (read: blackheads).The only downside is that it won't remove makeup very easily, so I only use it in the morning and use my trusty cold cream at night.This 4 oz side is perfect to throw in your gym bag or overnight suitcase.", "overall": 5.0, "summary": "Must-have for sensitive skin", "unixReviewTime": 1112140800, "reviewTime": "03 30, 2005"},
{"reviewerID": "A2W10YRC8CWAD7", "asin": "B000052YMV", "reviewerName": "Amazon Customer \"the undersigned\"", "helpful": [1, 1], "reviewText": "Cetaphil Gentle Skin Cleanser is the gentlest facial cleanser I have been able to find. I am highly allergic to several different soaps and preservatives, but Cetaphil doesn't cause me to break out, itch, or dry up.I'd suggest the liquid Cetaphil cleanser instead of their soap bar, as bars can cause one to have clogged pours (read: blackheads).The only downside is that it won't remove makeup very easily, so I only use it in the morning and use my trusty cold cream at night.This bottle is rather large.  I use it to refill my 4 oz bottle since it's cheaper to buy 16 ounces at a time.", "overall": 5.0, "summary": "Best Bang for your Buck", "unixReviewTime": 1113264000, "reviewTime": "04 12, 2005"},
{"reviewerID": "A13STKDYQO5DQ8", "asin": "B000052YQ2", "reviewerName": "S. Hebbron \"S B H.\"", "helpful": [15, 15], "reviewText": "Give it 2-3weeks and I gaurentee you will be glad you tried it, it is light and thirst quenching on the skin and seems to cover a multitued of tasks, you will not need seperate creams for eyes etc. My tip is to use it a s a night and day cream after gentle washing and exfoliaiting the face. By night put slighty too much on so as the skin has to slowly drink it in.You really will see a plumpness and radiance to your face in this space of time. This stuff is not bank breakingly expensive either.", "overall": 5.0, "summary": "Nothing will give skin as good as this!", "unixReviewTime": 1119052800, "reviewTime": "06 18, 2005"},
{"reviewerID": "ABWQP3ABN4EK6", "asin": "B000052ZB1", "reviewerName": "D. Mancino \"D. Mancino\"", "helpful": [0, 0], "reviewText": "This is the stuff. And as pointed out by another reviewer, SPF 25 would definitely be a better precaution than 15 but this moisturiser is so good otherwise I can overlook it for now. The main aspect of it that appeals to me is that the product actually stays on the skin and keeps moisturising all day. On a face as dry as mine is that is a rare accomplishment. Other creams bite the dust in a few hours on me.A reliable product that does what it claims to do at an especially good price.", "overall": 5.0, "summary": "Got really, really dry skin?", "unixReviewTime": 1109808000, "reviewTime": "03 3, 2005"},
{"reviewerID": "A1IU7S4HCK1XK0", "asin": "B000052ZBD", "reviewerName": "Joanna Daneman", "helpful": [1, 1], "reviewText": "I loved this gel from the day it debuted many years ago. Thankfully, the scent is the same, rather like Neutrogena soap. The pump is nice on the tub ledge and the gel works great in the shower, too. It rinses clean in any water, hard or soft. I like to follow it up with the Neutrogena sesame oil for the body. Great stuff.", "overall": 5.0, "summary": "Slick and soft, smells divine!", "unixReviewTime": 1128211200, "reviewTime": "10 2, 2005"},
{"reviewerID": "A2W10YRC8CWAD7", "asin": "B0000530LO", "reviewerName": "Amazon Customer \"the undersigned\"", "helpful": [6, 8], "reviewText": "Suave Daily Clarifying shampoo is great for removing build up.  I use it weekly because my dandruff shampoo builds up after a while; my friend uses it daily because the many styling products she uses leave her hair looking dull.The bottle says for \"normal to oily\" hair, but my hair is dry and I've never had an issue with it drying out my scalp.This has to be the best bargain shampoo in the world.  If I didn't suffer from dandruff I would use it only a daily basis.", "overall": 5.0, "summary": "Best Bargain Shampoo", "unixReviewTime": 1112140800, "reviewTime": "03 30, 2005"},
{"reviewerID": "A1Z54EM24Y40LL", "asin": "B0000530M0", "reviewerName": "csm", "helpful": [3, 7], "reviewText": "I got this shampoo hoping that it would help my dried out winter hair. Well, it made it worse! I looked like Broomhilda afterwards; it stripped my hair of anything that it had left and I looked as if I'd stuck my finger in an electrical socket wet. I don't recommend it at all if you have dry hair. If your hair is oily, then I think this would be fine. It sure smells nice and clean though! Save your money for a professional brand - they definitely overshot the marketing on these!", "overall": 1.0, "summary": "Not a great shampoo", "unixReviewTime": 1113523200, "reviewTime": "04 15, 2005"},
{"reviewerID": "A2W10YRC8CWAD7", "asin": "B0000531NU", "reviewerName": "Amazon Customer \"the undersigned\"", "helpful": [8, 10], "reviewText": "Maybelline Volum' Express Mascara is so much better than Great Lash.  It goes on evenly and lengthens without clumping.I always use my mascara long past the three month suggested shelf life and it doesn't get dried out very quickly.  (However using mascara after six months puts the user at a risk of infection, so be warned.)And it really is waterproof.  You'll need a reliable mascara remover if you want it to come off your lashes.  I've sat through tear-jerkers wearing Volum' Express and come out without a smudge (much less racoon eyes!)", "overall": 5.0, "summary": "Best Buy Drugstore Mascara", "unixReviewTime": 1112140800, "reviewTime": "03 30, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B0000535RA", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [43, 57], "reviewText": "Neutrogena's Pore Refining Cleanser is actually a wonderful 1 Step Cleanse/Exfoliate/Refine product that is perfect for traveling. Why take three products when one will work very well. In fact, my husband brought this product home when I asked him to buy me a similar product and I'm even more impressed with the Alpha and Beta Hydroxy Formula than any of the formulas with Benzoyl Peroxide.While I'm only testing this product at home, studies have shown that a combination of glycolic and salicylic acid is more effective than benzoyl peroxide. I read about it after I tried this product so my short time of personal experience proved the study was quite correct. Glycolic Acid is also found in many products sold to you by your Esthetician and it is known for stimulating collagen and elastin. It will even help to reduce acne scars and will keep dead skin cells from building up inside the hair follicles. Glycolic will also help the skin not to grow over the pores and so it prevents ingrown hairs. This product will be especially enjoyed by men who shave. Women will enjoy this product as it may prevent hormonal breakouts.This product contains \"Glycolic Acid\" which seems to prevent problems and is derived from fruit, whereas Benzoyl Peroxide has to fix the problems caused by a lack of exfoliation. So, using a product with Glycolic Acid seems to keep my skin exfoliated. While there are gentle microbeads, you don't really feel them and this is much more like a facial gel wash than an abrasive cleanser.This product impressed me so much I even sent a tube to a friend in the mail. Not something I'd normally do unless I was very impressed.For even better results, try a cream with Glycolic Acid or look for Vital Sciences Glycolic Liquid Exfoliator or Skin Eternal DMAE Serum. There are also quite a few Glycolic moisturizers for face and body from Peter Thomas Roth and Reviva. I also love the Derma E Glycolic Facial Cleanser.If you use a product with Glycolic Acid and one of the Derma E skin care creams or the Kiss My Face Under Age Organic Moisturizer, you should notice a much clearer complexion.Other essentials include:Derma E Tea Tree and E oilKiss My Face Acne GelAroma Land Problem Skin Blend - Essential oilDerma E Alpha Lipoderm with Green TeaDerma E Age-Defying Day CremeDerma E Clear Skin 2D'Arcy Drying LotionZia Sulphur MaskZia Papaya PeelDerma E Microdermabrasion ScrubJoey Pure Pores~The Rebecca Review", "overall": 5.0, "summary": "Glycolic Acid/Salicylic Combination Better than Benzoyl Peroxide", "unixReviewTime": 1128211200, "reviewTime": "10 2, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B0000536F0", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [8, 12], "reviewText": "Not long ago, I started putting oatmeal in a little bit of cheesecloth and added it to my bath. Then, I added rosemary and other herbs for variety. The combination of oatmeal and rosemary seems to be very healing.While this soap contains oat flour, it doesn't contain herbs. It is a nice soap to use in the tub but it has to be put in a dry place after your bath because it gets very creamy and soft and can be used up faster than you intend it to be used.Aveeno products heal the skin and are comforting, soothing products. You will start to notice your skin looking much more smooth and healthy after using products with oatmeal.If you love this product, you might also enjoy using the Aveeno Daily Moisturizing Lotion, Aveeno Stress relief Body Wash or Aveeno Stress Relief Moisturizing Lotion.All the Aveeno items calm and relax. I especially love the Stress Relief Lotion in the 2.5 oz tube that can be kept in your purse. The burst of Lavender, Chamomile and Ylang-Ylang is healing at any time of the day.~The Rebecca ReviewLover of Long Baths with Essential Oils and a Poetry Book", "overall": 5.0, "summary": "Healing Creamy Lather", "unixReviewTime": 1119484800, "reviewTime": "06 23, 2005"},
{"reviewerID": "AK7CAW3N1XZV6", "asin": "B0000536M3", "reviewerName": "Beth Cholette \"doctor_beth\"", "helpful": [5, 5], "reviewText": "This has to be one of the best mascaras I have ever tried (and I've tried many!).  My lashes are both thin and short, and I've found that this mascara adds plenty of fullness AND a bit of length, too.  Plus, there are absolutely NO CLUMPS when I use this mascara; the unique brush deposits just the right amount of product on my lashes, unlike other products that claim to be \"clump-free.\"  I've tried both the regular and the waterproof versions of this mascara; I prefer the latter, as it stays on great yet washes off easily.  The only thing that I think could make this product better would be a curling brush to give the lashes a bit more lift.  Although Full 'N Soft isn't a dramatic mascara, it is perfect for everyday wear, and I would recommend highly to anyone.", "overall": 5.0, "summary": "A near-perfect product!", "unixReviewTime": 1119312000, "reviewTime": "06 21, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B00005375C", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [0, 1], "reviewText": "While I'm not overly enthusiastic about the scent of this unscented product that is easily remedied by the addition of any essential oil I want to add before slathering this on my skin. The main ingredient seems to be Oat Kernel Flour and that is the main reason I buy this product.The skin calming and healing qualities of oatmeal are almost immediately apparent. Within a few days of using this product you will notice a difference in your skin.This lotion absorbs easily, it is smooth, healing and a creamy comforting addition to your day. If you enjoy scented lotions, try the Aveeno Stress Relief Moisturizing Lotion. I also enjoy using the Aveeno Body Wash and Soaps.If you want to scent this product, buy some rose oiland add a few drops. Rose oil helps to balance your emotionsand that in itself will help your skin.~The Rebecca Review", "overall": 5.0, "summary": "Calming Oatmeal", "unixReviewTime": 1128211200, "reviewTime": "10 2, 2005"},
{"reviewerID": "A28TWWUAWFVCTR", "asin": "B00005A43X", "reviewerName": "Never pay retail", "helpful": [2, 3], "reviewText": "This product is not at all good for short hair.  The barrel is huge!  I know the description gives the 1-1/2\" measurement but nowhere does it say anything about hair length recommendations.  I have to wrap my hair around half the brush and hold it there with my hand (hot!) because it doesn't even begin to wrap enough to stay on there.  Slightly better luck with the curling iron attachment.  This will be a fine product if you have at least shoulder length hair.  Otherwise, look elsewhere.  Now I am hoping mine burns up so I can return it at Amazon's expense instead of mine.", "overall": 3.0, "summary": "not for short hair", "unixReviewTime": 1129161600, "reviewTime": "10 13, 2005"},
{"reviewerID": "A2X3OBHN1ICMZJ", "asin": "B00006598X", "reviewerName": "Elizabeth A. Borst", "helpful": [16, 18], "reviewText": "I would never go back to using a regular towel for my hair after trying this little miracle towel. Wrap it around soaking wet hair and it absorbs amazingly. It not only cuts drying time down but makes it unneccesary to rub and rub which is damaging to the hair. They also hold up to many uses. It's really revolutionary!", "overall": 5.0, "summary": "A Must Have", "unixReviewTime": 1118016000, "reviewTime": "06 6, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B00006IGL3", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [5, 8], "reviewText": "This calming gel will soothe your skin. I found a small sample in a sample kit and was impressed with the ingredients. Peppermint, Lavender, Rosemary, Safe, Aloe Vera, Witch Hazel, Tea Tree, Chamomile, Camphor and Bergamot oil top the list for healing.This formula helps to neutralize any bacteria and is especially good for oily skin. You can use this over your entire face or just for spot treatment.Also look for Pore Shrink Deep Pore Cleansing Mask and the Start Up Exfoliating Face Wash.I'd like them to make these containers twicethe size, at least.~The Rebecca Review", "overall": 5.0, "summary": "Cooling Gel", "unixReviewTime": 1130630400, "reviewTime": "10 30, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B00006IGL8", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [6, 12], "reviewText": "\"Your skin is your body's largest organ, comprising many layers with varying functions. It is in constant contact with the outside world, so it needs extra care to keep it looking and feeling its best. Applying nutrients directly the skin maximizes their effectiveness...\" ~Kiss My FaceI thought I must be dreaming when I found such a wonderful line of organic products. Kiss My Face has always impressed me with their beauty products, first the soaps and then the lotions. Now they have an entire line of simply delicious obsessively organic products. If you have been looking for deep cleansing in a totally natural way, you will adore the preservative free deep pore cleansing mask and many other products like the Jojoba and Mint Facial Scrub or the Exfoliating Face Wash.This mask was a refreshing treat and contains Organic Floral Water of Lemongrass, Dandelion, Lemon Balm, Rosemary, Steam Distilled Water, Infusion of Certified Organic Herbs of Chamomile, Fennel, Milk Thistle, Certified Organic Aloe Vera, Kaolin Clay, Bentonite Clay, Witch Hazel, Vegetable Glycerin, Tea Tree Oil, Lemongrass Oil, Clove Oil, Peppermint Oil and Grapefruit Oil.This formula will minimize your pores, control breakouts and increase circulation. Clove, tea Tree and Lemongrass Oils are antiseptic and anti-inflammatory. After using this product your skin will feel super clean and healthy.Since using this mask on a regular basis I've notice a reduction in the size of my pores. If you love this product, you might also want to try the Joey Pure Pores Product. With these two beauty products, I've seen amazing results. Also try the Burt's Bees Clay Mask.If you fall in love with this product, also look for:Exfoliating Face Wash - Revitalizes and Exfoliates without abrasion.Facial Cr&egrave;me and Sunscreen - love this productOrganic Sugar Body ScrubThe products are made with the best wildcrafted botanicals. All the products are noncomedogenic and are free of synthetic ingredients and artificial fragrances.~The Rebecca Review", "overall": 5.0, "summary": "Tones Your Entire Face", "unixReviewTime": 1121817600, "reviewTime": "07 20, 2005"},
{"reviewerID": "A1TKX01K86Y3G9", "asin": "B00008MOQE", "reviewerName": "Product Junkie", "helpful": [2, 2], "reviewText": "I use the Great Lash with a curled brush and love it. I've tried the straight brush and unfortunately it makes my skinny lashes clump together. The curled brush however goes on evenly without globs. If you go through mascara monthly like I do, this is an inexpensive solution to having great lashes!", "overall": 5.0, "summary": "Great Product!", "unixReviewTime": 1135814400, "reviewTime": "12 29, 2005"},
{"reviewerID": "A3PV7BY8K747QE", "asin": "B00008ZPG9", "reviewerName": "Mary \"Mary\"", "helpful": [5, 7], "reviewText": "Nice texture and lightly fragranced.  Leaves skin soft.  Have only used for about a week;  no miracles so far, :), but I like the product.", "overall": 5.0, "summary": "Perfecting Cream", "unixReviewTime": 1124150400, "reviewTime": "08 16, 2005"},
{"reviewerID": "A3R11XXC7MVNYW", "asin": "B000092OX4", "reviewerName": "Pamela U. Moore", "helpful": [69, 71], "reviewText": "Like all women have, I've tried the expensive name brand age-defying creams, cleansers, lotions, etc., but NONE of them have produce any results except the Olay Regenerist line.  I wear this Enhancing Lotion with UV protection every day under my makeup, and alone when I don't wear makeup.  It's great for any kind of skin, and especially sensitive or for people with allergies like myself.  The wrinkles are less noticeable, and that's something that I could NOT say about the Estee Lauder and Clinique lines that I used for so long; I got tired of paying so much money for NO results!Ladies, once you start using this line of Olay's, you will never go back to the department stores.", "overall": 5.0, "summary": "I've actually seen results!!", "unixReviewTime": 1126483200, "reviewTime": "09 12, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B0000AJ3PU", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [4, 4], "reviewText": "The Colloidal Oatmeal in the Aveeno Products is the reason I keep buying them, even if I'm not overly excited about smoothing petrolatum over my skin.I wish these products were all natural. I have noticed the oatmeal has a calming effect on my skin and the addition of Lavender, Chamomile and Ylang-Ylang is emotionally healing.The minute you put this cream on your skin, you can feel the difference. Your skin becomes calm, soothed and smooth and silky. Perfect for after a shower or during the day when you need a calming moment.~The Rebecca Review", "overall": 5.0, "summary": "The secret is oatmeal", "unixReviewTime": 1128211200, "reviewTime": "10 2, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B0000C4COV", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [16, 21], "reviewText": "If regular Tea Tree oil is too strong for your sensitive skin, you might enjoy using it in a more subtle form, like in this skin cr&egrave;me with vitamin E.There are many uses for this product and the ingredients are: Purified Water, Tea Tree Oil, Safflower oil, Stearic Acid, Glyceryl Stearate, Cetyl Alcohol, Tocopherly Acetate (Vitamin E-3,000 I.U.), Glycerin, Allantoin, Panthenol, TEA, Aloe Vera Powder, Almond Oil, Avocado Oil, Sesame Seed Oil, Horesetail Extract, Citricidal, Phenoxyethanol.Tea Tree oil is an antibacterial, antifungal and antiseptic ingredient. You can use this cream all over your entire body or just use it for problem areas, blemishes, sunburn, skin dryness, rashes, dermatitis or even on babies for diaper rash.Since this product also contains avocado oil, you will also get the benefit of vitamins A and D. This oil is easily absorbed by the skin and is quite nourishing.I used this cr&egrave;me after a day in the sun and my skin felt very healed, smooth and soft. The Aloe Vera in this product is great for sunburn or skin irritations.~The Rebecca Review", "overall": 5.0, "summary": "Aloe Vera and Tea Tree Oil", "unixReviewTime": 1130630400, "reviewTime": "10 30, 2005"},
{"reviewerID": "A1X2LENOF84LCQ", "asin": "B0000CC64W", "reviewerName": "D \"D\"", "helpful": [62, 75], "reviewText": "I have tried so many products to just be totally disappointed. But this one does work. The lines under my eys are my problem area and this has helped to make them much less noticeable..Manufactures take note-- I am tired of the false claims and when I find something that actually works I will buy it. Most I have tried before do not work and should not be advertised as such.", "overall": 4.0, "summary": "This does work ladies", "unixReviewTime": 1113350400, "reviewTime": "04 13, 2005"},
{"reviewerID": "A3PV7BY8K747QE", "asin": "B0000CC64W", "reviewerName": "Mary \"Mary\"", "helpful": [15, 16], "reviewText": "Serum goes on smoothly and sinks right in.  I always use the Perfecting Cream on top in daytime and the night cream over it in the evening. My skin seems clearer and softer after only about a week.", "overall": 5.0, "summary": "Serum", "unixReviewTime": 1124150400, "reviewTime": "08 16, 2005"},
{"reviewerID": "A2OW1FKQFPIA5D", "asin": "B0000CDVN6", "reviewerName": "DMD", "helpful": [22, 34], "reviewText": "Somewhere in the fine print for this item I'm sure there is a sentence that says, \"Buy this if you're a sucker.\"I use a regular ceramic curling item to make spiral curls in my hair.  It works great, but when I saw this item I had visions of even better curls, so I ordered it.What a pain to use.  This iron has a raised spiral pattern along the length of the barrel, and you're supposed to painstakingly wind your hair between these raised spirals... I'm guessing to make an even curl.  It takes forever to do this.  I did ok on the right side of my head (I'm right-handed) but I had trouble doing the left side.  You have to be a contortionist to get the iron at the correct angle and roll it up smoothly.  And remember that this is coming from an experienced curling iron user.Were my curls any better than with a conventional curling iron?  That would be a big fat NO.  AND it took double the amount of time to curl my hair.  I kept it, solely because it is good to have a back-up if your regular iron dies at a critical moment, but I don't have any interest in using it.", "overall": 2.0, "summary": "Don't bother", "unixReviewTime": 1123891200, "reviewTime": "08 13, 2005"},
{"reviewerID": "A1P4F6HIXU6WYE", "asin": "B0000Y3FQC", "reviewerName": "Lee Mellott \"Work at Home Author\"", "helpful": [19, 20], "reviewText": "I had never heard of this product before I came across some reviews of top beauty products on makeupalley.com. Folks raved about the power of this little tool. At $47 I was hesitant but decided to ante up. And I am so glad I did.The #11 buffer is an outstanding tool. Used dry, you simple rub it across your feet. Dry skin quickly sheds off leaving a soft smooth surface. I follow the buffing with a good moisturizer and tuck my tootsies in socks. The results are smooth, soft pampered feet!The price may seem high at first, but a pittance when you think of all the money you would have spent on pedicures.The tool is designed to last for years and after use a quick wash with a small soft toothbrush and soap will have it ready for the next use.An excellent value!", "overall": 5.0, "summary": "Outstanding buffer..the #11 Diamancel !", "unixReviewTime": 1111536000, "reviewTime": "03 23, 2005"},
{"reviewerID": "ASGIVOW34XNQS", "asin": "B00012NI7E", "reviewerName": "sparky_magic_rainbow", "helpful": [18, 21], "reviewText": "This is a very rich hair treatment that's more effective than regular conditioner. It leaves my hair very soft+shiny. For best results I completely wet hair with lukewarm water/slather on/wait for 15 minutes/wash with placenta shampoo from the dollar store and follow up with a dollop of Suave Milk+Honey Conditioner (another cheap product that smells divine). If I go more than a few days without this regime -- my hair becomes dry and dull ... probably due to the hard water we have in SF Bay Area. I cant recommend this product enough. DO YOUR HAIR A FAVOR AND BUY THIS NOW :)UPDATE: Pls dont use dollar store shampoos or Suave. I switched to Body Deli shampoos to avoid toxic parabens+amines. The scalp absorbs chemicals.", "overall": 5.0, "summary": "cant live without it", "unixReviewTime": 1128384000, "reviewTime": "10 4, 2005"},
{"reviewerID": "A1SYLII0808HD6", "asin": "B00012NKGS", "reviewerName": "M. Allen Greenbaum", "helpful": [21, 32], "reviewText": "This exfoliant is designed to wake up your skin, scrubbing it with tiny abrasive ingredients to get rid of the old and bring forth the new.  It exposes a newer layer of cells, removing dirt and older skin cells.  One's face feels fresher and looks healthier.  Burt's Bees does this and more, and it's the more that I don't like.In its admirable stance of using natural ingredients, the product contains sweet almond oil and almonds, vegetable glycerine, oats, orange peel and oil, rose powder, pecan powder, grapefruit seed extract, nutmeg powder, clove powder, tocopherol (vitamin E), and fragrance.  It's the nutmeg and clover that I don't like.  The scent is so strong that it feels like you've smeared pumpkin pie on your face.  The scent lingers, even after several rinses.  It's glorious if you love this smell, but it's very annoying if you don't.  Although it's called \"citrus,\" the overloaded spice smell completely dominates; I didn't smell citrus at all.The other problem is a noticeable oily texture.  The oily feeling does rinse away, but aesthetically it's a letdown, antithetical to the fresh, cleansing feeling one expects.  The product has a not uncomfortable \"grit\" to it, so it's up to the exfoliating task. Still, I'd easily recommend similar products by Origins and Alba over this Thanksgiving potpourri.", "overall": 3.0, "summary": "Nutmeg and Clover, Over and Over", "unixReviewTime": 1120176000, "reviewTime": "07 1, 2005"},
{"reviewerID": "A1X93ES4DITTWK", "asin": "B000142U9E", "reviewerName": "Blueberry Muffin", "helpful": [21, 21], "reviewText": "This isn't your everyday gel that flakes and turns your hair into a helmet. Fantasia gel is thick like pudding and has a citrusy fragrance. I have thick, curly hair that's unmanageable at times, but all I have to do is put this gel on my wet hair, put a scarf on, and then I'm done. No frizzies and no hairs sticking up. My waves and curls are even defined. I'm recommending this gel because I have been using it for 3 years and it WORKS. The most important thing to remember is to apply it to your hair when it's wet/damp.", "overall": 5.0, "summary": "The Holy Grail of Gels", "unixReviewTime": 1121040000, "reviewTime": "07 11, 2005"},
{"reviewerID": "AEUY5C51JAWWH", "asin": "B00014D138", "reviewerName": "Scout Leader", "helpful": [7, 9], "reviewText": "I do! This is my new daily moisturizer. I use it over the Jason Hyper C Serum. I thought it would be too heavy together, but it really \"soaks in\" and doesn't leave me feeling slimy like so many products do. I'm really a soap and water girl at heart, but am too old now to neglect the skin like that. Give it a go!", "overall": 5.0, "summary": "I didn't really think I was going to like this, but....", "unixReviewTime": 1129939200, "reviewTime": "10 22, 2005"},
{"reviewerID": "AEUY5C51JAWWH", "asin": "B00014D1OW", "reviewerName": "Scout Leader", "helpful": [0, 0], "reviewText": "I feel like a giant lemon bar when I use this product. This is a gently clarifying shampoo I use once a week or so, alternating with the Alba Botanicals product line. The smell and lather is great (lathers a LOT more than the usual \"natural\" hair products). Organic, too!", "overall": 5.0, "summary": "YUMMMY smell!", "unixReviewTime": 1129939200, "reviewTime": "10 22, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B00014DIKE", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [11, 12], "reviewText": "There is comfort in the scent of lemon. Perhaps it reminds us of summer days and lemon meringue pie or the simple pleasures of zesting a lemon. This formula also contains rosemary oil and eucalyptus.Ingredients: Sea salt, baking soda, lemon oil, rosemary oil, eucalyptus oil, vitamin E.This bath salt will help your body to release lactic acid that builds up when you exercise, so it is perfect for relaxation and for easing muscle aches. The essential oils penetrate to relieve soreness.Add the crystals when you start filling the tub so they have time to dissolve.~The Rebecca Review", "overall": 5.0, "summary": "Lemony Bath Crystals", "unixReviewTime": 1110585600, "reviewTime": "03 12, 2005"},
{"reviewerID": "AK7CAW3N1XZV6", "asin": "B0001VKL7U", "reviewerName": "Beth Cholette \"doctor_beth\"", "helpful": [1, 2], "reviewText": "Burt's Bees Lip Shimmers provide your lips with a bit of color and shine and are a nice alternative to lipstick.  Like the original Burt's Bees balm, the Lip Shimmers contain peppermint oil, which gives your lips a slight tingling sensation; I actually didn't like this at first, but I've come to enjoy the little pick-me-up it provides.  Rhubarb is a pinky red that is just a bit too bright for my tastes, so I've found that a light hand during application is key.  As another reviewer mentioned, I wish this product came in more colors, as I've sampled testers of the other colors and have found them all to be a bit on the bright side.  Finally, don't be concerned by the \"shimmer\" in the title, as you'll get more of a gloss than sparkle from this product. Overall, I would recommend Burt's Bees Lip Shimmers as great option for days when you don't want to wear lipstick but don't want to go bare.", "overall": 4.0, "summary": "Moisturize your lips while adding a bit of color and shine", "unixReviewTime": 1127433600, "reviewTime": "09 23, 2005"},
{"reviewerID": "AEUY5C51JAWWH", "asin": "B0001VKL7U", "reviewerName": "Scout Leader", "helpful": [7, 8], "reviewText": "This is a great, natural line of lip products that feel great and wear well. The color is wonderful, too. It is a tad intense, but looks great on a gal with dark hair and eyes. Go for the Watermelon shade if you want a lighter look. I especially like the peppermint oil zing.", "overall": 5.0, "summary": "Why isn't everyone using this stuff?", "unixReviewTime": 1129939200, "reviewTime": "10 22, 2005"},
{"reviewerID": "A1BHCE2409B5QF", "asin": "B0001VOJWI", "reviewerName": "Victoria", "helpful": [1, 4], "reviewText": "This is one of those perfumes you must test for yourself before buying or you are destined to be dissapointed.  I bought a sample vial because I read so many good reviews and am glad I only spend three dollars! This stuff reeks! This is worse than grandma scent, its nauseating. I asked my husband what he thought and his response was: \"Phew! What the hell is that?\"Yeah. It does last a very long time but what's the use.", "overall": 1.0, "summary": "Awful", "unixReviewTime": 1123459200, "reviewTime": "08 8, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B00021CNCK", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [0, 0], "reviewText": "Finally I have found a delicious, light, everyday scent. Not to heavy or over-powering, this refreshing apple scent is great for any day. Just ask my dog, she agrees with me.", "overall": 5.0, "summary": "Dude, this is SWEET!", "unixReviewTime": 1124064000, "reviewTime": "08 15, 2005"},
{"reviewerID": "A1HEC6K4A223XB", "asin": "B0002260DW", "reviewerName": "Annie", "helpful": [7, 7], "reviewText": "My favorite of all LUSH's Bath Bombs!  Smells so good, and leaves my skin really soft and moisturized.  What I love best about LUSH's bath bombs (and the bubble bars) is the fact that you don't need to rinse off after using them.  You just relax in your tub, and when you're done you just towel off.The  Sex Bomb contains jasmine, which I am not really a fan of, however I found this bath bomb to smell SOOOO good.  It must be the other essentials oils as well.  The scent lingers and I can still smell it the next day.  Sex Bomb made my bath water (I don't have a tub, but I used my boyfriends tub) a really nice pink color, and the rice paper rose slowly dissolved.  It made the water so silky and soft as well.  As weird as that sounds, you know what I'm talking about if you've tried a LUSH bath bomb before.  For those of you who don't know what I'm talking about, go out and get one NOW!  You won't be disappointed!Good things DO come in small packages!", "overall": 5.0, "summary": "The scent is so nice... it's intoxicating!", "unixReviewTime": 1135555200, "reviewTime": "12 26, 2005"},
{"reviewerID": "A10Z8FC0SMU5VQ", "asin": "B0002260DW", "reviewerName": "Dorraine M. Rooney", "helpful": [3, 5], "reviewText": "this is great when you need that sexy feeling...the paper flower that emerges from the bomb is beautiful...the scent on the skin will drive your mate wild...", "overall": 5.0, "summary": "How to feel sexy", "unixReviewTime": 1129680000, "reviewTime": "10 19, 2005"},
{"reviewerID": "A1RECBDKHVOJMW", "asin": "B0002260DW", "reviewerName": "Jana L. Perskie \"ceruleana\"", "helpful": [162, 173], "reviewText": "If you have never tried a LUSH Bath Bomb, you've never really lived! Treat yourself! This is a feminine, feel good, smell good, pamper yourself, playful product if there ever was one. The name's right too!!I have to admit, I had not been pampering myself enough recently, and rarely had time for a leisurely bath last summer. It was jump into the shower in the AM and off to work. Then, especially in NYC, there's the morning, afternoon and evening rush, a quick dinner, maybe another shower, hit the sack, and then it begins all over again. I pulled a muscle a few weeks ago and bought some bath salts to relieve the pain. I realized how good it felt to bathe again - to make time to relax. I mentioned this to a friend, (Thank God for girl friends!!), who hustled on over to the nearest Lush store and picked up a potent Hot Pink SEX BOMB Bath Bomb for me!!!OK! So what does one do with a bath bomb. Clean your tub!! Then fill it with water. I like mine hot. Drop in the bomb and it will fizz like crazy and dissolve. You can dive in while it is melting or wait. I was and am impatient. For those bombs containing flower petals or other surprises, wrap the globe in nylon before use. The water should feel silky soft and the entire room will smell wonderful and steamy.Now, I hate pink - which I don't consider to be a real color. ..so much for girly-girls! But this was such a lovely gesture from a good friend, and so I made an exception. She wanted feedback, no less. Fortunately I used this product before going out, because (WOW!) once you experience the eroticism of bathing in the alluring scent of jasmine and ylang ylang, lying back in the tub with a towel cushioning your head and neck, and the warm, fragrant steam wafting by your face, you will not want to sleep. As I said, the name's right - for a reason. You will feel invigorated and want company to share your newly softened, lush smelling skin.Anyway, back to the bath. I turned the lights low and lit a candle to enhance the experience. And the lack of light did help to hide the fact that my bath water was pink - but a much softer, more subtle color than the outside of the bomb, fortunately. Clary sage essential oil,  with reported aphrodisiac properties, is a primary ingredient which helps sooth and smooth the skin. And again, the smell was heavenly.I have since become addicted to Lush's bath bombs, there are all kinds with just one purpose - to pamper you and make you feel terrific! Check them out. You deserve it! This one is a real winner!JANA", "overall": 5.0, "summary": "A Decadently Sumptuous Indulgence!", "unixReviewTime": 1129075200, "reviewTime": "10 12, 2005"},
{"reviewerID": "AIIR8E34EDKCQ", "asin": "B0002260DW", "reviewerName": "- Kasia S.", "helpful": [43, 45], "reviewText": "I love Lush things, but in general they tend to smell similar, well, this bath bomb, make the water a hot pink, and it smells like sweet, flowery musk. In other words, it's insanely enchanting.I think the dictionary should have a picture of this Bath Ball under the definition of beautiful, beacuse this simply it.And I love how consistent they are, every single one of the Sex Bombs I bought smells the same. Major points there!I think I've used like 8 of those all ready. I can't stop buying them, great product, and a nice unique scent!", "overall": 5.0, "summary": "Stunningly pink and lovely bath", "unixReviewTime": 1133827200, "reviewTime": "12 6, 2005"},
{"reviewerID": "A1HEC6K4A223XB", "asin": "B0002260L4", "reviewerName": "Annie", "helpful": [9, 10], "reviewText": "I really didn't like the smell of this Big Blue  in the store (though it really smelt like the ocean... dried seaweed and all!), however when I got home to try it, the smell was actually kind of sweet smelling rather then dead fish smelling.  Thank goodness because I found this to be the best bath bomb to use to soothe sore and achy feet.  I work retail, so I'm on my feet for hours at a time and when I get home, I crumble some of the Big Blue into my foot spa and it deodorizes and relieves my feet so quickly.  The real sea salt works as an anti-inflammatory and helps any swelling go down also.I don't have a bathtub to actually try it as a BATH bomb, but I can imagine how great it would feel.  The seaweed in the bomb also helps to soften my rough feet and when I follow with LUSH's Fair Trade Foot Lotion, my feet are so comfortable!", "overall": 5.0, "summary": "Best bath bomb to deodorize and soothe sore puffy feet", "unixReviewTime": 1135555200, "reviewTime": "12 26, 2005"},
{"reviewerID": "A10Z8FC0SMU5VQ", "asin": "B0002260L4", "reviewerName": "Dorraine M. Rooney", "helpful": [7, 8], "reviewText": "this is great for people with sore tired muscles...as it spins I keep my knees bent and keep it under my legs...the seawees feels like a thousand little fingers against my skin...what a great way to feel better at the end of a long day....", "overall": 5.0, "summary": "seaweed crazy", "unixReviewTime": 1129680000, "reviewTime": "10 19, 2005"},
{"reviewerID": "A1RECBDKHVOJMW", "asin": "B0002260N2", "reviewerName": "Jana L. Perskie \"ceruleana\"", "helpful": [32, 33], "reviewText": "\"Shampoo that looks like a round, green lava pumice stone - you've got to be kidding!! Who thought up that packaging gimmick?\" This was my reaction when a friend showed me her latest method for washing and de-tangling her hair. My hair is plentiful, but it is baby fine and flyaway. I take very good care of it, always have, but any product that leaves more than a touch of residue, (for conditioning purposes), weighs my tresses down. Also, I color my hair and have to be careful I don't dry it out. Skeptically, I tried out Karma Komba, and WOW!This hard shampoo lathers up beautifully and quickly. It rinses out leaving my hair squeaky clean - with no tangles. I just use a dab of conditioner - and that's not always necessary with Karma Komba. Made with essential oils, with undertones of citrus and spices, this product is also good for the scalp. It works well for most hair types. A slight scent of patchouli lingers - but very faint and pleasant. The result is glossy, soft, full bodied hair. I immediately ordered 3 more \"rounds\" to have on hand when this one is finished. I am addicted - a real fan! I have since tried other LUSH products and have had good results so far. Very highly recommended!JANA", "overall": 5.0, "summary": "KARMA KOMBA - Lush Suds, Exotic Scent, Fantastic Results!!", "unixReviewTime": 1107388800, "reviewTime": "02 3, 2005"},
{"reviewerID": "A2W4UPPE8RUT6Z", "asin": "B000273PEO", "reviewerName": "ElaineReads \"ElaineReads\"", "helpful": [3, 6], "reviewText": "I saw Happy to Be in an email announcement from Clinique when it first came out.  I wasn't really interested in trying it out because I thought I'd like Happy Heart but don't.  I was shopping in a department store one day and saw that if I purchased the $80 bottle, I got a nifty little tote bag with a very cute, small size bottle of the perfume.  I couldn't resist!Let me just say, I love the bag, but not the perfume!  It's too citrusy...  I like subtle perfumes and this one is definitely strong!  I think of the Clinique perfumes, I'll stick with Happy although I now own the whole \"Happy\" set.", "overall": 3.0, "summary": "3 stars because it's part of the Happy family!", "unixReviewTime": 1126137600, "reviewTime": "09 8, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000273PEO", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [2, 2], "reviewText": "It's a lovely light refreshing perfume. Lovely for daywear. Loves it guys!", "overall": 5.0, "summary": "Oh So Perfect!", "unixReviewTime": 1127520000, "reviewTime": "09 24, 2005"},
{"reviewerID": "A1A2F1ZOWOPNJB", "asin": "B00028OC4K", "reviewerName": "Al", "helpful": [1, 2], "reviewText": "I bought it as a gift for my gf in Beijing.  The dusty polluted air there is tough on people with oil skin.  3 times a day and her complexion started clearing up.  It also worked great as a hand soap.  I poured it in an empty Aveeno Foaming Face Wash dispenser, and was quite satisified with the outcome.There is no substitute for proper diet and rest to treat your acne, but if you you want a nice smelling organic wash that cleans without over drying, give this one a try.", "overall": 5.0, "summary": "One of the better face washes", "unixReviewTime": 1122336000, "reviewTime": "07 26, 2005"},
{"reviewerID": "A3UZKHULL9LP9A", "asin": "B0002JKPA4", "reviewerName": "slinkylink", "helpful": [16, 18], "reviewText": "This is my third set in 10 years.  But understand my first 2 sets I used almost EVERY DAY plus my roommate used it and eventually it stopped producing steam.  Everything has to be replaced.  Having said that I LOVE IT.  This is the best thing to curl your hair.  It is not damaging because it is steam and the curl lasts much longer", "overall": 5.0, "summary": "Great curlers", "unixReviewTime": 1130284800, "reviewTime": "10 26, 2005"},
{"reviewerID": "A340T3DDR0ZTZ6", "asin": "B0002JKPA4", "reviewerName": "TMarie \"Corndotz1\"", "helpful": [70, 85], "reviewText": "Like some other reviewers, I really miss the original Caruso units that required salt.  I guess I wasn't the only one who was nearly electrocuted on the metal prong several times.  That didn't stop me from using it until it croaked though. The original set truly made curls that would last for days.  This new set is somewhat disappointing.  It's better than the Revlon steam rollers, but I'm still not completely satisfied with the product.  My curls only last for a day.  Since I have long hair and only wash my hair every few days, I need more lasting curls.  Some people have complained that the curlers start to deteriorate. I believe that is caused from using the curlers after applying gel or hairspray or other hair products.  These curlers should be used only on freshly washed hair.  The only other complaint I have is that it the size of the curler is embossed in hard to read print and is on the opposite side of the curler than it should be.  Since the curlers will logically be placed with with the marked size down, it is hard to tell which size is which.  I usually group them in sizes, so I don't have to think about it.  The jumbo and large sizes look the same from the bottom and so do the small and extra small.  Overall, the curlers work as well as regular hot rollers, but they are much less damaging.  They do take more time to use though, since it is necessary to heat one roller at a time.  I probably would have given them 5 stars if I hadn't used the original Carusal rollers.", "overall": 3.0, "summary": "Average steam roller set", "unixReviewTime": 1122854400, "reviewTime": "08 1, 2005"},
{"reviewerID": "A2YWRWSLEJRM92", "asin": "B0002OCNMC", "reviewerName": "Pennsylvania Reader", "helpful": [4, 7], "reviewText": "This note of alert is intended for those who care:  Amazon includes this soap in its category \"cruelty free,\" a choice on the left side of the page that narrows results within \"soap.\"  That is flat-out incorrect.  The ingredients listed on the package include goat's milk, but the main ingredient is tallow--in other words, animal fat.  It might or might not be tested on animals (I don't know), but it is definitely MADE of animals.  I ordered this based on its good reviews and Amazon's categorization of it as cruelty-free.  Since the ingredients are not listed in the product description as of this writing, and because repacking and returning items is a pain in the neck, I am mentioning it for those who might, like me, want to know.", "overall": 2.0, "summary": "NOT cruelty-free (Amazon categorizes it as such)", "unixReviewTime": 1119830400, "reviewTime": "06 27, 2005"},
{"reviewerID": "A26R0WOGRMZB22", "asin": "B0002SA9BU", "reviewerName": "Angela Compres", "helpful": [127, 134], "reviewText": "Hi,I'm not a \"review\" person, but when I read the existing reviews, I felt like doing this.I used this product for 2 months and I must tell you that it really WORKS!I'm hispanic-black woman (dominican) with relaxed fine hair and my hair grows normally, but only neck-chin lenght, no further than that. With this product I achieved a maximum growth rate and now my hair is leaving behind the accustomed lenght.I bought again the product to see how longer it can grows!!!I've been completely sincere with you...I'm not a staffer of this product company, I'm a real and very happy user!!!Hope this comment will be helpful for other women. I have only one last thing to say: Try it!!!! It worked for me...", "overall": 5.0, "summary": "Excellent and recommendable!", "unixReviewTime": 1120176000, "reviewTime": "07 1, 2005"},
{"reviewerID": "A1WKUY7T0EM0GM", "asin": "B0002TSCZY", "reviewerName": "Krystal James \"genie\"", "helpful": [21, 21], "reviewText": "This is my second flat iron, a replacement to a conair 3/4 $15 dollar iron. If you are worried about the cost, DON'T be; it's worth it. My hair has never looked better, and the best part is that it lasts until I wash my hair again. I no longer have to fear drizzle and humidity and rain or going to sleep and waking up with a mess on my head. I don't feel like I'm damaging my hair like with my old conair, and the results are far better. There is no fuzziness to my hair when I'm finished and all it takes is one swipe. When I was using the conair, I would have to go over it with my curling iron and the results would last, if I was lucky and the weather was perfect, two days. And my ends would also looked fried. With my Solia, my hair is straight, light, and shiny and it doesn't frizz or fuzz up. And my ends have yet to looked fried while using the Solia. ^_^ My hair also looks healthier than it ever has before.", "overall": 5.0, "summary": "leap of faith", "unixReviewTime": 1122681600, "reviewTime": "07 30, 2005"},
{"reviewerID": "A1SYLII0808HD6", "asin": "B0002TSCZY", "reviewerName": "M. Allen Greenbaum", "helpful": [95, 97], "reviewText": "The Solia is the hair iron that the three bears would have chosen: Neither too hot or too cold, too cheap or too expensive, it's a product that's just right.These irons can go for as little as $25 or so, and on up to about $150 and more. The cheaper irons can damage your hair, and the more expensive ones can put holes in your hair.  As described (very well) in the \"features\" section here at Amazon.com, the Solia combines ceramic with tourmaline, a gem that creates six times more negative ions than ceramic alone. These ions, combined with the heat (which the user can \"dial\" to a temperature between 140 and 450 degrees Fahrenheit) give you the capability to change the direction and texture of your hair.More than just a hair straightener, the lightweight Solia can give you flips, curves (both towards your face and away), and generally shape your hair.  It's lightweight and heats up quickly.  I don't know exactly how the \"patented Dynamic Alignment System\" works; I do know that the iron glides easily and without pain through short and long curly hair.  Extra curly, thick hair will conform to the new straight look your stylist gave you, and there's a beautiful sheen due to the hairs' alignment.  It comes with an instruction booklet; I'd also recommend the product's website at folica.com.  A product that consistently works well at a resonable price make this an excellent value.", "overall": 5.0, "summary": "Salon Styling at Home!", "unixReviewTime": 1126483200, "reviewTime": "09 12, 2005"},
{"reviewerID": "A15A4RX02DDFER", "asin": "B0002TSD08", "reviewerName": "S. Smith", "helpful": [24, 27], "reviewText": "this iron works great, and this is the advertised prices on other sites such as folica.com . it heats up in less than 20 seconds, and can reach up to 450 degrees farenheit. the higher settings work better on ethnic hair. i have blonde hair that is long and over processed, but it looks great. my favorite feature is definately the fast heat up, now waking up late doesnt keep me from straightening my hair", "overall": 5.0, "summary": "great, one of the best professional flatirons", "unixReviewTime": 1115683200, "reviewTime": "05 10, 2005"},
{"reviewerID": "A2AZFELROH9QVO", "asin": "B0002XG9X2", "reviewerName": "Superstar \"It is only by risking that we live...", "helpful": [34, 43], "reviewText": "The young lady that wrote the first review was incorrect. You can use it on your face and nose. In order to use it for your face, you have to turn the plastic suction piece around. It is reversible. Its an effective product.", "overall": 3.0, "summary": "Didn't read instructions", "unixReviewTime": 1118534400, "reviewTime": "06 12, 2005"},
{"reviewerID": "A27493GW3TEX65", "asin": "B000629ZHG", "reviewerName": "L. Wilde", "helpful": [179, 189], "reviewText": "If you only want a hit of color and a natural, lightweight amount of coverage, this is the foundation for you. This tint can be worn alone but it's best over your existing moisturizer, especially if you have even a tiny bit of dryness (you don't want your skin to be drinking in makeup, do you?) This moisturizing formula will hydrate, soften, and impart a very healthy looking glow to the skin. Tinted Moisturizer is a great choice for women who want to look natural but still have a few things to cover because the look and feel are sheer and lightweight but it provides light to medium coverage. SPF 20 is a nice addition to help protect the skin from both UVB rays as well as some UVA rays.* On the scale of Laura Mercier's foundations, Tinted Moisturizer provides the lightest coverage. Yet despite being so lightweight in look and feel, Tinted Moisturizer is extremely long wearing, stays color true all day long (a boon to oily skins) and wears evenly.More than just a makeup product, Laura's Tinted Moisturizer has a special \"antioxidant vitamin complex that acts as a free radical scavenger to protect skin from even the most aggressive effects of the environment.* \" Who hoo! Bonus!Notes on shade choices:Being that it is difficult to render color accurately on a computer for the purpose of color swatches, the following notes should help you select the appropriate shade of Tinted Moisturizer. If you already use one of Laura's foundations and know the color name, I made note of the approximate color of Tint you would likely use.-VERY FAIR skin tones or those who use Laura's Foundation in colors Porcelain Ivory or Blush Ivory would use Tinted Moisturizer - PORCELAIN-FAIR TO LIGHT skin tones or those who use Laura's foundation in the color Warm Ivory would use Tinted Moisturizer - NUDE-LIGHT TO MEDIUM skin tones or those who use Laura's Foundation in colors Sunny Beige or Vanilla Beige would use Tinted Moisturizer - SAND-MEDIUM skin with PINK TONES or those who use Laura's Foundation in colors Shell Beige or Vanilla Beige would use Tinted Moisturizer - FAWN (note-this is not super pink)-MEDIUM skin tones or those who use Laura's Foundation in colors Golden Beige or Honey Beige would use Tinted Moisturizer - ALMOND-MEDIUM to DARK skin tones or those who use Laura's Foundation in colors Suntan Beige or Sunset Beige would use Tinted Moisturizer - TAN-DARKER skin tones or those who use Laura's Foundation in colors Toffee Bronze or Deep Bronze would use Tinted Moisturizer - WALNUTIt's quite normal to fall between two shades due to the infinite variety of skin tones and tan variations throughout the year. If this is the case for you, Laura recommends mixing those two shades together to get the perfect, custom match. Many of her clients do this. You'll only use about half the amount of  each shade when you mix (therefore each tube lasts you twice as long) so over the space of a year you don't end up spending any more money on foundation than you would if you only purchased one color. Plus you get the bonus of precision matched color. Also, most of us tend to darken a bit in the summer and lighten up a bit in the winter at which point you'll have just the right shade at your fingertips. Another trick I like with Laura's Tinted Moisturizer is mixing a little of it with my oil-free foundation to get a slightly more natural looking finish or to slightly lighten or darken the color here as well.Easy to Use:Apply after skincare/moisturizer, using a downward motion with fingertips or a sponge. The downward blending motion helps to keep the foundation from getting under the very tiny, and nearly microscopic hairs we all grow on our faces. A sponge will help you apply the product more evenly than using your fingers. Laura makes a fantastic and machine washable version.Tinted Moisturizer can be worn with or without Laura's famous, award winning, and best selling Foundation Primer underneath. An application of Foundation Primer first will naturally extend the wear of Tinted Moisturizer especially for oilier skins or all skins in warmer/humid months. If you prefer a soft/slightly moist finish, set the Tint with a small amount of Translucent Loose Powder by lightly tapping with the side of the Powder Brush. For a more matte finish, set Tinted Moisturizer with Translucent Loose Powder or Pressed Setting Powder (which provides more coverage than loose) using the Laura's wonderful and machine washable Powder Puff.*While being SPF 20 (refers to UVB only), the active ingredients Laura uses in her Tinted Moisturizers do provide a small amount of  UVA protection yet are not completely broad spectrum. All of Laura's daytime Moisturizers provide SPF 15 in the form of avobenzone (listed under the chemical name) which is fully UVB and UVA protective. As a professional, freelance makeup artist, this is my preferred route. UVA/UVB sunscreen in a foundation makes it much thicker and can give the color a slightly `off `or `whitish cast. UVA/UVB sunscreen also reflects light and this shows up in pictures as `ghost face' -- a horror for brides when they get their pictures back. Having sunscreen in your moisturizer won't have this same effect because you top it with foundation or powder which keeps the reflection at bay.", "overall": 5.0, "summary": "Seeking Natural but Flawless? You've Just Found Your Match", "unixReviewTime": 1106265600, "reviewTime": "01 21, 2005"},
{"reviewerID": "A2X3OBHN1ICMZJ", "asin": "B00062A0JI", "reviewerName": "Elizabeth A. Borst", "helpful": [24, 24], "reviewText": "I just started getting dark circles under my eyes and needed to call out the troops (Secret Concealer, Secret Brighter and Secret Brightening Powder). I like the concealer. It's creamy, easy to apply and comes in four colors to match skin tone. It covers well but to really make the darkness dissappear you need to deflect and set with the other products. I would not be happy with the concealer on its own but as part of a \"team\" it's excellent. Since I'm not only getting darkness directly under the eye but lower on the bone of the eye socket it's important that the shade be perfect and it is. Go to a Laura Mercier counter and pick it out in person. I took off a star because it doesn't do the whole trick on it own.", "overall": 4.0, "summary": "Creamy Coverage", "unixReviewTime": 1119830400, "reviewTime": "06 27, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B00064A5L4", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [3, 7], "reviewText": "Daring and provocative, enigmatic and mysterious, Be Delicious is a perfume with much to say. Dazzling with its spicy heart notes, Karan's message is seductive and perhaps even troubling. Way to go Donna Karan! 5 stars for you!", "overall": 5.0, "summary": "Sweet and Sexy!", "unixReviewTime": 1120521600, "reviewTime": "07 5, 2005"},
{"reviewerID": "A1BHCE2409B5QF", "asin": "B00064A5L4", "reviewerName": "Victoria", "helpful": [5, 9], "reviewText": "Smells fresh and slightly fruity but not cloying at all. Since I generally dislike fruity perfumes that was a plus. Nice enough but not heart stopping. I don't think I'll buy it again.", "overall": 4.0, "summary": "Nice for summer and someone young", "unixReviewTime": 1120262400, "reviewTime": "07 2, 2005"},
{"reviewerID": "A2X3OBHN1ICMZJ", "asin": "B000674XN2", "reviewerName": "Elizabeth A. Borst", "helpful": [13, 13], "reviewText": "I had previously used a similiar product from Yse Saint Laurent that's been around for a while and although that was good at highlighting Laura Mercier's has a more natural pinky tone and can be used directly on dark circles under the eyes and also above the cheek bone to deflect light. Although you have to apply it with a light hand under the eye or it can have the opposite effect and draw too much attention to the area. It imparts a very natural youthful look. It also opens up the eye and adds a pearly dewiness. It takes off a few years which is great for a not so young woman but is also nice on those who still have the bloom of youth as it will make the eyes pop out and give off a little gleam. It's not an artificial shimmmer but a radiance that flatters in every light. I use it with Laura Mercier's concealer  . I put the brightener mosltly around the eyes starting at the top of the cheek bone and ending at the temples.", "overall": 5.0, "summary": "Open Eyes", "unixReviewTime": 1119830400, "reviewTime": "06 27, 2005"},
{"reviewerID": "A2X3OBHN1ICMZJ", "asin": "B000674XNM", "reviewerName": "Elizabeth A. Borst", "helpful": [4, 6], "reviewText": "I had never thought of putting a powder under the eye. Wouldn't it cake and settle in fine lines? Not this powder. It's feather-light and bright while it keeps Laura Mercier's creamy concealer in place. It is reflective and fine. It can also be used to set eye make-up. Who would have thought...?", "overall": 4.0, "summary": "A Bright Idea", "unixReviewTime": 1119830400, "reviewTime": "06 27, 2005"},
{"reviewerID": "A27493GW3TEX65", "asin": "B000674XNM", "reviewerName": "L. Wilde", "helpful": [66, 69], "reviewText": "Laura Mercier's heavenly and lightweight Secret Brightening Powder makes your under eye area look bright and naturally radiant. If you suffer from chronic dark under eye circles like I do you'll love how this powder weightlessly increases the coverage of under eye cover products while adding soft focus lightening and brightening. It helps concealer to dramatically reduce the appearance of dark under eye circles as it sets concealer to keep it in place all day!Unlike other powders which can accentuate the look of dryness and lines in the eye area, Laura Mercier's specially formulated under eye powder gives a soft focus to fine lines and minimizes imperfections. The powder is ground to the micronised level so it won't settle in the fine lines to emphasize like other powders can so easily do.Usage Instructions:Keep in mind a little of this product goes a very long way. Pat powder lightly on the area of application without dragging or tugging across skin. Laura recommends using her Camouflage Powder Brush which I agree makes any powder applied in the eye area look softer and less heavy while guarenteeing a soft and even application. It helps you get just the right amount applied. Secret Brightening Powder is great under the eye where allergies, stress, and lack of sleep show up quickly. Ideally this is used to set Laura's Secret Brightener (a lightening brush wand highlighter), Secret Concealer (Laura's fantastic under eye concealer), and/or Secret Camouflage (Laura's famous and award winning camouflage coverup.)Remember, if you get enough of anything packed on in one spot it will show up so only use a little bit. I recommend tapping the above mentioned brush into the fine film of powder on the inside of the lid. [With the lid in place, tip the jar upside down and then right side up again. When you remove the lid you'll notice a fine film of powder there.] Rarely do I need more than this. Even though the container is smaller than the average face powder, it has lasted me a very long time even with constant use. I also use it to set creme shadows and eye shadow bases with the end result being a very `clean' eye look that resists creases. The silky texture also makes applying powder eye shadow a dream! As a makeup artist I've used this powder all around the eyes of women of a broad range of skin tones (from pale Irish to deep African American) and different ages (from teen to great grandma) all having varying degrees of lines, bags, and dark circles and still got the same fabulous results every time. Secret Brightening Powder is also appropriate for all skin types. It's rare that one product works well on everyone.Finer Points:-Micronized Pigments provide a soft weightless texture that won't settle into lines . . . really.-Silicone Polymers provide an out of this world, slippy, silky feel.-White Transparent Pigment offers an invisible lightening effect on the skin without the look of ashiness. The formulation is so sheer that it works on any and all skin tones. Instantly opens up your eyes.", "overall": 5.0, "summary": "A Powder to Lessen Eye Lines and Dark Shadows? Yes. Really.", "unixReviewTime": 1106179200, "reviewTime": "01 20, 2005"},
{"reviewerID": "A1FMWLZ9YY91XI", "asin": "B000674Z8A", "reviewerName": "K. Kasabian", "helpful": [16, 16], "reviewText": "I've never much cared for makeup sponges, because the disposable triangle versions, the ones you buy in bulk, scratch my face and are a burden on the environment. I'd always imagined there was something out there that was a bit softer and hopefully, more permanent. The day I walked up to a Laura Mercier counter, my search ended.I was sold on texture alone. These biodegradable sponges respect a sensitive face, yet are sturdy and hold up over many months. Since they're washable, there's no need to worry about bacteria build-up. They absorb quite a bit, but one Mercier makeup artist taught me the neat trick of dampening the sponge a bit with water before squeezing out the foundation. As I prefer a lighter application anyway, I've found that this helps blend the foundation into my skin very well. It also means I use less foundation over time.Figure in less waste and fewer trips to the drugstore to buy the cheaper sponges, and it becomes clear that spending more now is a great investment over time. Your face will thank you.", "overall": 5.0, "summary": "Ingenious little sponges", "unixReviewTime": 1106524800, "reviewTime": "01 24, 2005"},
{"reviewerID": "A2X3OBHN1ICMZJ", "asin": "B00067EJ4U", "reviewerName": "Elizabeth A. Borst", "helpful": [42, 43], "reviewText": "I thought I had tried everything in make-up but after reading about foundation primer thought I might be missing something. I did wonder though if this was really needed. After putting it on in the morning every day for a week now I don't want to be without it. The primer not only makes a better canvas of the skin for make-up by helping it blend more easily and evenly but make-up stays in place and true to color until you take it off at the end of the day. There's also a slightly reflective glow that makes skin look younger and healthier. What more can you ask for? It goes on smoothly over my moisturizer with a light consistancy. I think it even locks in the benefits of my moisturizer. My skin tends towards dryness and this together with my moisturizer leave it more radiant and it never gets dry or dull. I also like the idea of a barrier between my skin and my make-up -- less foundation or powder clogging the skin. The only thing I would caution is that those with oily skin may become a little too glowing by the end of the day and need a light dusting of powder. I even would if I preferred a matte appearance. When the weather gets humid I probably will. Just when I thought I had everything and looked the best I could with the products I use I ran accross this to further improve my look and found the extra step to be very worthwhile.", "overall": 5.0, "summary": "A Worthwhile Added Step", "unixReviewTime": 1108080000, "reviewTime": "02 11, 2005"},
{"reviewerID": "A27493GW3TEX65", "asin": "B00067EJ4U", "reviewerName": "L. Wilde", "helpful": [107, 114], "reviewText": "Once when I had the honor of meeting the famous Makeup Artist Laura Mercier in person, I asked her what one beauty product she would want if stranded on a desert island. Without hesitation she replied in her beautiful, soft, and very French accent, \"Foundation Primer, of course!\" This left me curious as to how she chose one product so quickly out of the myriad in her arsenal. Most women choose lipstick, concealer, or mascara; why would Ms. Mercier choose a makeup prep step above all other products -- something most women have never even heard of? \"Even if you didn't have foundation to put on top?\" I cautiously countered, not wanting to insult her choice. \"Of course, my Foundation Primer is more than just a primer. I wear it even when not wearing makeup at all,\" she replied sweetly.What is Foundation Primer?Just as an artist woudn't think of painting on an un-primed canvas, Foundation Primer fills in the little lines and pores, evening the skin tone and texture for a more flawless finish to makeup. Foundation glides on the skin more easily and stays looking fresh longer by creating a silky barrier between skin and foundation. Ideal for all skin types, oilier skins will notice their foundation staying color true throughout the day [the darkening occurs when oils secreted by the skin mix with the makeup and give it a darker look] and are happy this oil-free and pigment-free Primer won't add an extra layer to makeup. Drier skins will enjoy the benefit Foundation Primer has in sealing in the moisturizer so it won't evaporate during the day keeping the face soft and radiant as well as preventing talc (a common ingredient in foundation and powder) from drawing much needed oil out of the skin. Foundation Primer also helps prevent the skin from absorbing talc and pigment from foundation and powder -- a boon to blemish-prone skin. Did I mention it extends makeup wear? I find I can apply my foundation with Foundation Primer underneath, teach my morning aerobics classes, and my makeup still looks fresh enough to work the rest of the day as a makeup artist under the intense scrutiny all my clients consciously or unconsciously give. Makeup even stays put in hot, humid weather! This product is an absolute must for all my brides.How is Laura's Foundation Primer more than just a primer?Laura's primer contains \"unique light-reflecting ingredients\" which create a \"soft-focus appearance.\" This soft focus causes fine lines and imperfections to  smooth over as well as gives skin a soft, luminous, and healthy looking glow. Not just for under foundation, in fact Laura considers Foundation Primer a must for non-foundation wearers. The same soft focus appearance makes bare skin look beautiful and naturally flawless. Top with a little Loose Setting Powder and you have a smooth and luminous, beautiful and natural, barefaced look.This Primer also has added skin care benefits to improve the skin's appearance. Potent antioxidants Vitamins A, C, and E help protect skin from the harmful and dramatically aging effects of the environment. Foundation Primer also contains botanicals such as lavender, orange, jasmine, rose, geranium, grape, kiwi and aloe extracts to soothe and refresh the skin. Foundation Primer does not contain sunscreen, however all of Laura's daytime moisturizers have broad spectrum (UVA and UVB) protection in the form of avobenzone.It's simple and easy to use:Apply a liberal amount of this lightweight creme-gel on clean skin, after moisturizer. With fingertips, massage all over face, including eyelids, lips and throat (those with sensitive eyes may wish to avoid the eye area).  A large pea-sized amount, think garbanzo bean or chick pea, is all you need. If you find you require more, it may be an indication that your skin is dehydrated and you may need to up your moisturizer.Laura Mercier's #1 Top Makeup Tip:\"Place Foundation Primer in the refrigerator, the coolness is extra refreshing and helps reduce puffiness.\" (This tip is especially pampering in the summertime.) \"Take a few minutes to gently massage into the skin; a light massage is stimulating and healthy for the skin.\"", "overall": 5.0, "summary": "A Primer in Time Saves Nine (Beauty Troubles)", "unixReviewTime": 1106179200, "reviewTime": "01 20, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B0006BDMIU", "reviewerName": "Gail Cooke", "helpful": [1, 2], "reviewText": "Who says there's nothing new under the sun or, in this case, under the grape arbor? In what can only be thought of as a serendiptious meeting in 1993 young Mathilde and Bertrand Thomas met a professor from Bordeaux University on the estate of the Chateau Smith Hunt Lafitte.From this chance meeting the couple learned that the professor had discovered that seeds thrown away at the close of a grape harvest contained anti-ageing properties. Following research, experimentation, and several patents, Caudalie was born.A favorite from this line is Beauty Elixir, part tonic, part serum. Use of toners has proven too harsh, having a tendency to dry skin while the Elixir softens.In addition to the Grape Extracts Beauty Elixir contains Vitamins A, B, and C, extracts of Myrrh, Orange and Rose Flower, and oils of Rosemary and Mint.The Elixir, for use on a cleansed skin under moisturizer, tightens pores and smoothes the complexion leaving skin with a natural glow.", "overall": 4.0, "summary": "BUY THE LARGE SIZE AND SAVE!", "unixReviewTime": 1129593600, "reviewTime": "10 18, 2005"},
{"reviewerID": "A2MNUZHMGVN5G2", "asin": "B0006GZAKI", "reviewerName": "ARA", "helpful": [33, 33], "reviewText": "This is an excellent shampoo that has a lovely, soft scent.  If you want a shampoo that really is natural (unlike most shampoos from so-called natural companies), try any Aubrey Organics shampoo.  I like this one in particular for it's scent.  My hair is always soft, shiny, & silky after using Aubrey products.  This has a matching conditioner that works really well, too.", "overall": 5.0, "summary": "Excellent shampoo!!", "unixReviewTime": 1107043200, "reviewTime": "01 30, 2005"},
{"reviewerID": "A2MNUZHMGVN5G2", "asin": "B0006GZCVK", "reviewerName": "ARA", "helpful": [5, 5], "reviewText": "I love this conditioner.  It always leaves my hair soft, silky, shiny, and lightly scented (it smells great!).  It never weighs my hair down, it does help with frizzies, and you only need to leave it on your hair a couple minutes.  Best of all, it's truly all-natural!!!!!  Aubrey Organics also has a matching shampoo for this conditioner.  It's one of my favorites!", "overall": 5.0, "summary": "Excellent conditioner!!!", "unixReviewTime": 1107043200, "reviewTime": "01 30, 2005"},
{"reviewerID": "A2MNUZHMGVN5G2", "asin": "B0006GZDE6", "reviewerName": "ARA", "helpful": [11, 11], "reviewText": "This is one of my favorite Aubrey Organics shampoos (which I follow with the matching cream rinse).  It says it's for oily hair, but I think it works with any type of hair.  I don't have particularly oily hair, and I usually use the moisturizing types, but this works great & leaves my hair soft, silky, and shiny.  Other people I know with oily hair have great results with it as well.  It has a soft, fresh, pleasant scent, and you don't have to use very much (even with long hair).  I love it!!", "overall": 5.0, "summary": "Aubrey is the best!", "unixReviewTime": 1117238400, "reviewTime": "05 28, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B0006O2IQ4", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [4, 14], "reviewText": "My dog acutally introduced me to Inis Energy of the Sea Cologne Spray. She really likes it, so i picked up a bottle...and i love it too! wish i had found this a while back! everyone comments about it...smells so good! you can't go wrong with Inis Energy!!", "overall": 5.0, "summary": "My dog loves this.... and so do I!", "unixReviewTime": 1124668800, "reviewTime": "08 22, 2005"},
{"reviewerID": "A1Z54EM24Y40LL", "asin": "B0006ZHCK0", "reviewerName": "csm", "helpful": [11, 16], "reviewText": "You just can't do any better than Murphy's Oil soap to clean wood.  I've used this stuff for so many years and my mother and grandmother used it before me.  It gets everything wood clean and leaves such a great scent too behind.  It doesn't strip the wood and dry it out like most cleansers do, but instead, it replenishes it while cleaning at the same time.  I've even used this on my hardwoo floors and they look gorgeous.  I wouldn't ever buy anything else out there the clean my wood.  Period.", "overall": 5.0, "summary": "The best there is!", "unixReviewTime": 1108339200, "reviewTime": "02 14, 2005"},
{"reviewerID": "A2X3OBHN1ICMZJ", "asin": "B0007CXXYG", "reviewerName": "Elizabeth A. Borst", "helpful": [11, 11], "reviewText": "I alternate with other shampoos as they say you should so the hair doesn't become so used to one it stops working. I always go back to Awapuhi. My hair is fine and dry. Awapuhi imparts moisture but never wieghs it down. It actually leaves my blond hair shiny and almost fluffy (like a child's not like a poodle's) but not frizzy. It's gentle but gets it clean, clean, clean in one softly lathering application. There is nothing detergently about it and it feels different than other shampoos, almost like a rich gel. It rinses out easily and can wash the body as well. I don't have a great head of hair but at least with this shampoo it behaves itself. The only other shampoo that measures up is Keratase but it is expensive and the little bottle doesn't go a long way. Keratase has a formula which strenthens the hair with a creamy lather and a great hair mask which I use now to give my hair a break. But the one I always return to is Awapuhi, my old favorite.", "overall": 5.0, "summary": "An Old Favorite", "unixReviewTime": 1106006400, "reviewTime": "01 18, 2005"},
{"reviewerID": "A3R11XXC7MVNYW", "asin": "B0007IQMVG", "reviewerName": "Pamela U. Moore", "helpful": [13, 16], "reviewText": "I can't believe how soon I got relief, due to the fact that I have only been on it a short while.  I am on alot of medications for other health problems, and this does NOT interract with the prescriptions.  My \"running to the bathroom\" has subsided, but not \"fixed\" yet.  The information on and in the box does tell you that it takes about a week to tell a major difference.  I also like the fact that it is putting the natural enzymes back into the body that a person's intestines lack.Give it a try before you go to prescription; be patient and let it work before you judge.", "overall": 5.0, "summary": "Better than Imodium (so far)", "unixReviewTime": 1132531200, "reviewTime": "11 21, 2005"},
{"reviewerID": "A3PV7BY8K747QE", "asin": "B0007W1R58", "reviewerName": "Mary \"Mary\"", "helpful": [12, 15], "reviewText": "Smooth and creamy texture.  I don't like wimpy creams, this one is just right.  Have used about one week, like the results so far.", "overall": 5.0, "summary": "Night cream", "unixReviewTime": 1124150400, "reviewTime": "08 16, 2005"},
{"reviewerID": "A13STKDYQO5DQ8", "asin": "B00081J4P8", "reviewerName": "S. Hebbron \"S B H.\"", "helpful": [7, 8], "reviewText": "NO-AD products sell themselves on not bothering to advertise a good product, they sell on the word of mouth that the products are as good as any other sun/skin care, which smell good, soak into skin well, don't stain clothing and work well doing exactly what they claim to do on the bottle.Incidently the bottle's are basic with simple pump action dispensers and are made from easily recylable hard plastics.The fact that there is no hype, no nonsense and no false claim along with no attempt to waste money on hype, seem to have served this company well and has worked better than any glossy ads of perfect bronzed bodies from piz buin or ambre solaire, fair play to them! They are far more honest than any other skin care company I can think of!", "overall": 5.0, "summary": "A great product.", "unixReviewTime": 1119052800, "reviewTime": "06 18, 2005"},
{"reviewerID": "A13STKDYQO5DQ8", "asin": "B0008IV7BU", "reviewerName": "S. Hebbron \"S B H.\"", "helpful": [1, 5], "reviewText": "...like mushed bananas with a little fresh and zingy, manly fragrance thrown in, but my praise stops there unfortunately.The paste is to hard and never \"melts\" enough to use, spreads itself in micro clumps throughout your hair, will not aid funky styles one jot and has absolutley zilch staying power.I have found much cheaper products that do a better job!", "overall": 3.0, "summary": "Smells absolutely lovely...", "unixReviewTime": 1120780800, "reviewTime": "07 8, 2005"},
{"reviewerID": "A1F9Z42CFF9IAY", "asin": "B0008IV7BU", "reviewerName": "T. Tom", "helpful": [31, 37], "reviewText": "I was looking for a product with good hold but that didn't make my hair so shiny that I look like some sort of greaser all day. I found American Crew Fiber and really like it. It holds well (maybe not quit as well as American Crew Molding Creme, but less shiny), and does the job without ever feeling greasy, flaky or caky, unlike other products such as pomades or gels.Also, it smells good (smells a bit like mild soap) unlike other products I've tried which have an absolutely repulsive aroma (Matrix Dirty Trix). And once it's in your hair, the smell either goes away or in not noticeable at all.While I'm sure there are other products that provide more hold, all the ones I've tried add too much shine for my taste. With Fiber, my hair looks naturally good and clean all day without ever turning greasy or dirty looking or looking yucky like I have too much gel in my hair. And if my hair gets a bit messed up (like if it's real windy, etc.), it doesn't end up looking weird. It's hard to describe, but in this situation, my hair ends up looking naturally messed up rather than totally gross or sticky or flaky. In other words, it still looks good and natural even after a wind storm. And if I want, I can re-shape it with my hands and maybe a bit of water with no problem. Before, while using other products, after a windy day my hair would look totally gross.Another good product to consider is D:Fi Molding Creme however that's more difficult to find (note that D:Fi is owned by American Crew).I really wanted a product that allows a woman to run her hands through my hair without coming up yucky or greasy and I found it in American Crew Fiber. This is a good product and I would highly recommend it.NOTE-The way you apply it is rub a bit of it in the palms of your hands first and then apply to your hair. Anyone who says that it clumps up in your hair is applying it incorrectly.", "overall": 5.0, "summary": "Good hold without yucky greasy shine", "unixReviewTime": 1123200000, "reviewTime": "08 5, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B0009EILVM", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [0, 0], "reviewText": "It is very rare to notice results in the first use of any beauty product, especially one that promises firming and toning, not to mention minimizing the appearance of cellulite. While nothing seems to reduce cellulite like regular exercise, this is a perfect compliment to your exercise routine and it will firm up your entire body in all the right places.I started using this and the first place I tried it was on my breasts, stomach and thighs. I immediately noticed results (the next day) in the firmness of my skin everywhere I had used this product. I also appreciate that this product is non-greasy which means you can use it without worrying about your skin breaking out from oily formulas.The Botanical extracts firm and tone while caffeine and gotu kola help to minimize the appearance of cellulite. Pink grapefruit and marine algae help to aid detoxification.The gel is cooling and absorbs fast. It is a bit like a scented aloe vera gel that tingles slightly upon application.Ingredients: Aqueous Infusion of Gotu Kola, Echinacea Purpurea & Caffeine, Aloe Vera Gel, Licorice, Sea Kelp, Marine Algae, Yucca, Horse Chestnut, Gingko Biloba &Willow; Bark Extracts, Retinyl Palmitate (Vit. A), Tocopheryl Acetate (Vit. E), L-ascorbic Acid (Vit. C), Sodium Carbomer, Sweet Fennel, Frankincense, Geranium, Pink Grapefruit and Sweet Orange Essential Oils...I keep buying another tube of this product because there is no way I'm running out of this amazing product. I've already recommended it to a few friends and really look forward to smoothing this over my skin after a shower. It is truly magical and also contains Vitamin A and Vitamin C to nourish your skin. Try this, you won't be disappointed. Also works on upper arms or any other areas you want to firm and tone.~The Rebecca Review", "overall": 5.0, "summary": "Useful all year round...but especially in the summer", "unixReviewTime": 1110585600, "reviewTime": "03 12, 2005"},
{"reviewerID": "A1JSLN697CKTUV", "asin": "B0009F3O8Q", "reviewerName": "Mary Lou St. Lucas", "helpful": [16, 18], "reviewText": "No, it doesn't taste like chocolate.. (don't ask me how i know this)..  But it has a nice cocoa smell.This is my new favorite lotion, and i can even use it on my face without irritation or breakout.  Feels great after a shower or after being in the sun.  Makes my skin very soft but not greasy.Finally, a way to enjoy chocolate that doesn't make my butt big!", "overall": 5.0, "summary": "Mmmm... chocolate-y....", "unixReviewTime": 1125964800, "reviewTime": "09 6, 2005"},
{"reviewerID": "A13STKDYQO5DQ8", "asin": "B0009F3O8Q", "reviewerName": "S. Hebbron \"S B H.\"", "helpful": [7, 8], "reviewText": "I understand this stuff is really with a mind to scarred and problem skin, it has heaps of Vitamin E which is good for helping scar tissue to heal. It smells so completely delicious it could fool you into tasting it! Excellent moisturisier and long lasting effects. Great as an aftersun!", "overall": 5.0, "summary": "A great product for thirsty skin!", "unixReviewTime": 1110931200, "reviewTime": "03 16, 2005"},
{"reviewerID": "A2W4UPPE8RUT6Z", "asin": "B0009N35D2", "reviewerName": "ElaineReads \"ElaineReads\"", "helpful": [1, 3], "reviewText": "I first sampled Glow in a magazine I was reading and I really liked it.  I then asked and got it for Christmas.  I only wore it a couple of times before I decided that I couldn't stand it at all.  It is a very strong, flowery scent.  Sort of \"Old Lady\" in my opinion.  The bottle is cool, though, very feminine, so I still like it...  I just don't wear it!", "overall": 3.0, "summary": "3 stars because I love the bottle", "unixReviewTime": 1126137600, "reviewTime": "09 8, 2005"},
{"reviewerID": "A1GWUSPAM0RJVB", "asin": "B0009OAGXI", "reviewerName": "Danielle Nguyen \"Dinyell\"", "helpful": [1, 3], "reviewText": "This is a very nice perfume. Its not too strong, and it doesn't wear off too quickly. It has a nice rosy smell to it, and is definatly worth the buy :)", "overall": 3.0, "summary": "Nice", "unixReviewTime": 1106956800, "reviewTime": "01 29, 2005"},
{"reviewerID": "A1VCPMT1RRS7K0", "asin": "B0009OAGXI", "reviewerName": "Matt", "helpful": [4, 4], "reviewText": "This cologne is very light and \"summery\". It smells a bit of sweet citrus, but remains sophisticated. Very clean and fresh.", "overall": 5.0, "summary": "Truly a Summertime Scent", "unixReviewTime": 1129593600, "reviewTime": "10 18, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B0009OAHIW", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [21, 25], "reviewText": "I have been wearing Dolce & Gabbana for over 2 years now. The fragrance is wonderfull, I am not much on strong fragrances that are overpowering so this one by Dolce & Gabbana was perfect for me. The fragrance lasts all day without fading. Use it with Gabbana lotion and you have the perfect pair!", "overall": 5.0, "summary": "Heavenly!", "unixReviewTime": 1127520000, "reviewTime": "09 24, 2005"},
{"reviewerID": "A1P27BGF8NAI29", "asin": "B0009OAI8G", "reviewerName": "Alice in Wonderland", "helpful": [19, 22], "reviewText": "You are never fully dressed until you have on some perfume. Indeed, even when wearing nothing at all (or perhaps, especially when you are wearing nothing at all) you need some perfume - sweet, alluring and sexy. For me, my most favorite scent of all is Elizabeth Taylor's White Diamonds. White Diamonds is sweet without smelling too powdery or too flowery. It has an excellent scent that lasts on my skin and smells excellent.For me and the man of my life, it's got to be White Diamonds. We highly recommend this wonderful perfume to you, or perhaps for that special lady in you life!(Review of White Diamonds Eau de Toilette Spray Naturel, 1.7 oz.)", "overall": 5.0, "summary": "Sweet without smelling too powdery or too flowery", "unixReviewTime": 1126656000, "reviewTime": "09 14, 2005"},
{"reviewerID": "A1RECBDKHVOJMW", "asin": "B0009OAIIG", "reviewerName": "Jana L. Perskie \"ceruleana\"", "helpful": [26, 29], "reviewText": "French couturier Hubert de Givenchy took the same elegant fashion style which made him famous and bottled it with Givenchy's Amarige de Givenchy. This is my perfume of choice when I want to feel sexy. The scent radiates warmth, sensuality, pure class and Female with a capital \"F.\" A rich, complex blend of light and musky notes, with Givenchy violet, mimosa, soft sweet spices, and orange flowers, is accompanied by fruity notes of fresh citrus, melons, peaches, and plums. It is a sophisticated fragrance, but not at all heavy.I prefer to wear Amarige in the evening, and something less sexy, a woodsy or floral cologne, or Givenchy's Eau De Toilette, for work and sports. This perfume has been my standby for years, and although I have switched-off occasionally to try something new, I always return to Amarige. I personally prefer to purchase the smaller bottle. It may just be me, but I feel like scent changes, or becomes stale, once the bottle has been opened and kept too long. I do wear this a lot, but it still takes a while to go through an entire bottle, which, by the way, looks almost as beautiful as the perfume smells. I love it, but the scent one chooses is a highly personal decision, so, as with all perfumes and colognes, try a sample before you purchase.JANA", "overall": 5.0, "summary": "Amarige Radiates Warmth, Sensuality, And Pure Class!", "unixReviewTime": 1113523200, "reviewTime": "04 15, 2005"},
{"reviewerID": "A29L9B4D8OVD9L", "asin": "B0009V1YR8", "reviewerName": "MandyDoll \"Mandy Doll\"", "helpful": [49, 60], "reviewText": "This is the best flat iron ever!!! As an black female using this I can go longer without getting a perm. Every female should own one!!!!", "overall": 5.0, "summary": "AMAZING", "unixReviewTime": 1120348800, "reviewTime": "07 3, 2005"},
{"reviewerID": "A1A3M4L3UD8V8B", "asin": "B0009V1YRS", "reviewerName": "Blissfully Black", "helpful": [10, 12], "reviewText": "I had been letting my hair airdry (i'm black with a relaxer) and using ceramic curling irons to straighten my hair as i curled the ends. I decided to actually use a straightening iron to straighen (what a thought huh? lol) I went for the Chi flat iron. I didn't really appreciate how well it works until I used a cheaper ceramic flat iron one day. It made me realize I had been taking the Chi for granted. It gets my hair extremely straight. I have had the occasional hair snag but not as bad as when i used metal flat irons or even a cheaper ceramic flat iron.I have yet to master the curling of the ends using the Flat Iron though. Sometimes it comes out okay, and sometimes it doesn't. (I think the 1 inch might be too small for the curl I want.) I wonder if I might have better luck with curling the ends with a larger flat iron, but the trade off would be that I couldn't get as close to my roots.I don't use it everyday (I limit myself to using heat only one time a week and even then I might use a curling iron) but I'm already seeing a bit of wear on the outside of the iron where I grip it when I put it in my hair. I'm hoping it's just a cosmetic and won't start to burn my hands.August 09 Update:  Four years later, I still have this flat iron and it still works.  The only complaint is that the felt on the outside of the iron has pretty much worn off.  You can still grip it but it's hot to the touch.", "overall": 4.0, "summary": "Jumped on the bandwagon", "unixReviewTime": 1123891200, "reviewTime": "08 13, 2005"},
{"reviewerID": "A2W4UPPE8RUT6Z", "asin": "B000AAC8VO", "reviewerName": "ElaineReads \"ElaineReads\"", "helpful": [3, 13], "reviewText": "I thought I liked this perfume when I smelled the sample that came in the department store's catalog.  I hinted around enough that \"I had to have it!\" and so I got it as a birthday present.  Well, let me just say, I don't ware it!  It's kind of masculine in my opinion, and also a little soapy, maybe.  The truth is, I can't put my finger on exactly why I don't like it.Of course, I love the bottle for its uniqueness!  I think it's time I face perfume facts: Just because I like the bottle doesn't mean I will like the scent...", "overall": 4.0, "summary": "4 stars because I like the bottle", "unixReviewTime": 1126137600, "reviewTime": "09 8, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000AAC8VO", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [1, 3], "reviewText": "i bought this at sephora on the advice of another reviewer. it definitely delivers! beautiful smell that lasts all day long.=)it is the real deal in sugar sweet, miles ahead of the jessica simpson line.worth every penny=)", "overall": 5.0, "summary": "Surprisingly Seductive!", "unixReviewTime": 1120089600, "reviewTime": "06 30, 2005"},
{"reviewerID": "ADYZOSTF9LZLD", "asin": "B000AADENA", "reviewerName": "ShawnaLanne \"BookWog\"", "helpful": [6, 6], "reviewText": "I've never had a problem with painfully dry cuticles until recently. A friend had some cuticle oil at work, I tried it and it worked, but I didn't really like the oily residue that it left behind on my fingers, where you shouldn't really wipe it off. So when going to buy something different I went for a 'cleaner' product.Overall I am pleased. I've been using it daily for about a week and it has improved not just my cuticles, but the nails themselves feel healthier, the definitly look shinier when I am done.The texture, I think, is perfect. It is somewhere between a lotion and a non-sticky paste. The one I bought has appricot extract, I'm not sure if they all do, but it is a pleasing scent.I'd reccomend buying this", "overall": 5.0, "summary": "Affordable and Effective", "unixReviewTime": 1126396800, "reviewTime": "09 11, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B000AADF20", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [7, 8], "reviewText": "This handy little bottle of Vitamin E nail and cuticle oil fits nicely in your nail kit and doesn't leak like other bottles of vitamin E oil seem to on occasion. Wheat Germ oil, aloe, apricot kernel oil and safflower oil absorb quickly and keep your cuticles healthy.Apply when your nails are polished and dry or every day as a healing treat before bed. If you massage this oil into your nail bed it will help to stimulate new nail growth. Not recommended just before you have a manicure or pedicure. Use it as a finishing touch to soothe dry cuticles.Sometimes I run out of oil and refill this bottle with Kama Sutra massage oils or the Burt's Bees natural massage oils. You can also add some of your own essential oils.The brush makes it easy to apply this oil and the bottle never leaks.~The Rebecca Review", "overall": 5.0, "summary": "Healing Treatment for Cuticles", "unixReviewTime": 1133568000, "reviewTime": "12 3, 2005"},
{"reviewerID": "A1P4F6HIXU6WYE", "asin": "B000ALBKGW", "reviewerName": "Lee Mellott \"Work at Home Author\"", "helpful": [21, 21], "reviewText": "It's hard to describe the diamancel medium nail file and all the diamancel files for that matter because there is nothing quite like them on the market.A few years ago I invested in the #1 and #2 file and the #11 foot file. I recently added the #20 to my collection. The files are worth every cent and I will never go back to using cheap files again.The #2 shapes your nails beautifully. Unlike a harder metal file it is gentler on the nails. It can be washed and reused and will last for years.I also have the #1 file. The difference is in the grit of the file. If you are only selecting one I would choose the #2 if you have strong nails and the #1 if your nails are weaker and light and need gentle treatment.An excellent value. Well worth the $!", "overall": 5.0, "summary": "Diamancel Medium Nail File is outstanding!", "unixReviewTime": 1111536000, "reviewTime": "03 23, 2005"},
{"reviewerID": "AYOMAHLWRQHUG", "asin": "B000ALCJR6", "reviewerName": "Conspicuous Consumer", "helpful": [77, 91], "reviewText": "I first saw this hair dryer on a TV show talking about beauty products used by the stars.  Then I noticed my hairdresser had switched to this brand.  His observations were the same as mine.  If you take a lot of time drying hair and the weight of the dryer is an issue, this is a very good purchase.  But your hair will be no shinier or softer than with other dryers.", "overall": 3.0, "summary": "Very light & dries fast but other claims exaggerated", "unixReviewTime": 1127347200, "reviewTime": "09 22, 2005"},
{"reviewerID": "A4HI1DDZN54S1", "asin": "B000ALCJR6", "reviewerName": "L. Becker \"product junkie\"", "helpful": [16, 20], "reviewText": "A product that really lives up to all the hype for once?????? Could it be true??? YES!!!!  I was SO skeptical about this product, especially since it retails for $200!!! I saw all of the magazine reviews (In Style's Best Buy list, 2005, Allure, etc.), and being the product whore that I am, I was REALLY tempted when I saw that AMAZON.com had it for $159 (plus free shipping and no tax!)  So, I gave it a try.  I really didn't expect it to live up to all of the hype. Well, I have used it three times now and I am AMAZED!!!1.) I really does dry your hair in half the time.2.) My hair really did look and feel healthier!!3.) I can't believe how light this thing is! It feels like a toy!!!4.) It's SO QUIET, and5.) It does all this without getting hot and making me hot!!! Sometimes after a shower and then blow-drying my hair, I swear I need another shower my bathroom gets so hot. Not with this baby!!!I highly recommend it!!! It's definitely worth the money.", "overall": 5.0, "summary": "This thing is fantastic!!!!!!", "unixReviewTime": 1129939200, "reviewTime": "10 22, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000BIUGSM", "reviewerName": "Gail Cooke", "helpful": [21, 23], "reviewText": "Although my hair needs all the TLC it can get, there I was blow drying with the dryer set on High and then using a curling iron.  Little wonder that sometimes my hair felt as if it had been dried and fried.  Bumble and Bumble Styling Lotion to the rescue.Enriched with Keratin and vitamins, this Lotion protects hair from heated implements and gives it added body and shine.  It's a clear lightweight liquid that also prevents breakage.My recommendation is to spray it on damp hair before blow drying, and then lightly mist it over hair before using heated rollers or a curling iron.  You'll be surprised at the difference it makes.", "overall": 5.0, "summary": "FOR STYLE THAT STAYS", "unixReviewTime": 1120003200, "reviewTime": "06 29, 2005"},
{"reviewerID": "ACXCS6NRA4EVU", "asin": "B000BIVY1U", "reviewerName": "Seattle girl", "helpful": [6, 7], "reviewText": "This is a great conditioner. I have super fine hair, and after using this, along with the shampoo, I find that my hair is super soft, shiny and not at all weighed down. It also has a great, clean smell, which I love. I would definitely recommend it.", "overall": 5.0, "summary": "Perfect Everyday Conditioner for fine hair", "unixReviewTime": 1134345600, "reviewTime": "12 12, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000BIZSV2", "reviewerName": "Gail Cooke", "helpful": [7, 7], "reviewText": "It's summer and sun time.  Sun dries hair; color leaves it in serious need of TLC.  That's exactly what Bumble & Bumble Deeep offers.  Constant colorers and sun worshipers will find this conditioner indispensable to give new life to locks.Deeep is a rich, penetrating protein masque that is like a vitamin spritz for hair, leaving it hydrated, lustrous and shiny.Easy to use?  You bet.  After shampooing, simply work a dab (my hair is short so about a nickel size is plenty) through hair and then comb through to make sure masque covers from roots to ends.  Relax - read a book, watch television or meditate for 20 minutes then rinse off.No, it wasn't the meditation that made your hair look and feel so terrific - it was the Bumble & Bumble Deeep!- Gail Cooke", "overall": 5.0, "summary": "TERRIFIC TLC FOR YOUR HAIR", "unixReviewTime": 1118275200, "reviewTime": "06 9, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B000BR766S", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [13, 14], "reviewText": "When I tried a sample of the shampoo and conditioner I had no idea that the next time I went to wash my hair, it would feel completely different. I had my hair up in a bun (I had put it up to workout) and when I let down my hair after it was dry it felt so much thicker and almost like I had more hair.I was not quite sure why, but then I read about the strengthening effects of this shampoo and conditioner. My hair also felt so much cleaner and silky as if there was no build up and I had washed my hair in mountain spring water.Ingredients in Shampoo: Water, Rice Bran, Rice Oil, Coconut Oil, Seaweed, Ginseng, Aloe, Wheat Powder, Swertia Herb.Ingredients in Conditioner: Water, Rice Bran, Rice Oil, Coconut Oil, Seaweed, Ginseng, Aloe, Wheat Powder, Swertia Herb, Natural Vitamin E.Since this product is relatively expensive, I may have to alternate it with other shampoos and conditioners, but it definitely works. The shampoo doesn't strip the hair the way other harsh shampoos do and I'm very impressed with the natural ingredients cleaning my hair so well. If you have fine or oily hair you may be especially impressed. You also only have to shampoo once, which saves time.Results after one use:Smoother TextureStronger HairCleaner HairMore Body - especially if you have fine hairLooking forward to trying other products with rice bran. You can order a week's supply of this product to try. I think you will fall in love with the shampoo and conditioner.~The Rebecca Review", "overall": 5.0, "summary": "Strengthens Hair", "unixReviewTime": 1128297600, "reviewTime": "10 3, 2005"},
{"reviewerID": "A1RECBDKHVOJMW", "asin": "B000BTO6CI", "reviewerName": "Jana L. Perskie \"ceruleana\"", "helpful": [1, 1], "reviewText": "I have 3 or 4 favorite scents that I wear according to my mood and to the environment(s) I will be wandering through, leaving my fragrance behind. Jessica McClintock Eau de Parfum is, indeed, a very special scent which brings out the whimsical romantic, the feminine girly-girl in me.This light, poetic, innocent, extremely uplifting scent evokes the first flowers of spring, fresh delicate blooms with just a touch of green. The perfume, which debuted in 1988, has wonderful top notes of black currant, bergamot, and basil. The longer lasting base notes include a delicate white flower blend of lily of the valley, white jasmine, rose, and ylang-ylang, along with subtle hints of citrus, musk and sandalwood.I wear this perfume day and night, especially in the hot spring and summer months, but also during winter evenings, and at work. It really picks up my spirits and is an excellent natural mood enhancer on a gloomy day. As always, I am careful never to apply too much - just a spritz at pulse points. I do carry a purse size refresher with me.The Jessica McClintock Design House of San Francisco has long been associated with clothing that blends fantasy and romance. I have many friends who wore this perfume on their wedding day - very appropriately. One of the reasons I am writing this review is that the relatively new Vera Wang fragrance seems to be the upcoming romantic/bridal favorite. While I really like Vera Wang, both her designs and perfume, I don't think her scent is comparable to Jessica McClintock. When you go the perfume counter or store next, try the samplers and see for yourself.Highly recommended! ENJOY!JANA", "overall": 5.0, "summary": "This totally romantic, extremely uplifting scent evokes the first flowers of spring.", "unixReviewTime": 1129075200, "reviewTime": "10 12, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000C1UEOY", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [8, 8], "reviewText": "Beyond Paradise is a wonderful, flirty, floral scent that isn't too overpowering. I recommend wearing it whenever you want to feel extra feminine.", "overall": 5.0, "summary": "Flirty and Feminime!!!", "unixReviewTime": 1120694400, "reviewTime": "07 7, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000C1UF3Y", "reviewerName": "Gail Cooke", "helpful": [1, 1], "reviewText": "If memory serves, noted designer Giorgio Armani was once quoted as saying that his designs were created  not to be noticed but rather to be remembered.  A wonderful thought, typifying his always elegant, classic style. It's certainly true of his latest fragrance for men - Black Code.This is a subtle, sensual scent with a touch of the oriental found in notes of lemon and bergamot.  It's an ultra masculine fragrance, difficult to capture yet impossible to ignore.True to Armani's vision, the glass bottle is artfully crafted - a cylinder of the deepest blue.  It's gift boxed in the same color with printing in gray and white.  Available in 1.7 and 2.5 oz. sprays, Black code is sure to take its place by the side of Armani's always popular Gio and Mania.", "overall": 5.0, "summary": "A SUBTLE, SENSUAL FRAGRANCE FOR MEN", "unixReviewTime": 1114992000, "reviewTime": "05 2, 2005"},
{"reviewerID": "A1MFDFUGEVNIFK", "asin": "B000C1VT0W", "reviewerName": "AyJay", "helpful": [0, 0], "reviewText": "When I first saw CURIOUS while on holiday, I bought it without trying any. I just wanted the pretty bottle. When I opened it up back home I didn't have high hopes, impulse buying rarely works out does it? So what did I think?I love it. My first thought was; Sophisticated and classic. CURIOUS can be worn for work, shopping, evenings out - anywhere at any time!On the first spay you notice the top notes of magnolia and lotus flower, then the dreamy base of vanilla-infused musk, which lasts throughout the day. The best surprise of all?  After you've worn it for a few hours, you are surprised with the mouth-watering aroma of tangy pear.", "overall": 5.0, "summary": "A new classic...", "unixReviewTime": 1133654400, "reviewTime": "12 4, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000C1VT0W", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [12, 14], "reviewText": "First of all, I love the bottle. On the packaging, Britney gets a 10. I think it's young, I think it's fun. I like the color, the little heart, the little jewelry. It also has a kind of 'I Dream of Jeannie' vibe. They really got who she is. Mmmm, I like it, it's fresh. You know what? It's a little mouthwashy but it's young and it's fresh. I think this is all purpose. I think it's day and I think it's nice.Now that it's settled on you, it smells like an expensive perfume. It's sexy. It's evening. It's glamorous. It's making me want to get close to you!", "overall": 5.0, "summary": "Glamorous!!!", "unixReviewTime": 1120953600, "reviewTime": "07 10, 2005"},
{"reviewerID": "A13STKDYQO5DQ8", "asin": "B000C1VT3Y", "reviewerName": "S. Hebbron \"S B H.\"", "helpful": [2, 3], "reviewText": "I got some of this fragrance for Xmas and it is lovely. It has a classic and clean smell with manly musky tones and fresh fruity rings too. Suitable for day and evening. Allways gets nice comments from people. Very understated and classy as Burberry do so well really.", "overall": 5.0, "summary": "Really good stuff!", "unixReviewTime": 1110931200, "reviewTime": "03 16, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000C1VY9I", "reviewerName": "Gail Cooke", "helpful": [1, 1], "reviewText": "", "overall": 4.0, "summary": "daring and different", "unixReviewTime": 1120089600, "reviewTime": "06 30, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000C1W2DK", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [0, 0], "reviewText": "Paris Hilton fragrance is classy and a sexy scent at the same time. The sparkling signature of this scent personifies its creator.Chic enough to be worn to the hottest clubs, it also possesses a feminine, flirtatious charm. And for those who want to leave nothing to chance, a \"secret\" ingredient has been blended into this magic potion - one that's guaranteed to enhance the wearer's allure. Chic. Sexy. Mysterious. To be worn all the time! It is VERY  long-lasting! Trust me!!!", "overall": 5.0, "summary": "Wow!", "unixReviewTime": 1120003200, "reviewTime": "06 29, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000C1Z19M", "reviewerName": "Gail Cooke", "helpful": [4, 7], "reviewText": "Shi, the fragrance by noted designer Alfred Sung, is reminiscent of his total design philosophy which is classically modern, whether it be clothing, watches or small leather goods. This fragrance is subtle, fresh with a blend of Water Lily and Fig Leaves. Complementing the initial impression is a composition of Orange Blossom and Frangipani, resulting in a soft femininescent.As one would expect the packaging, both bottle and box, is elegant simplicity. Utilizing three of nature's elements, wood, water, and metal, Sung has created a beautiful design. The bottle, a perfectly rounded glass rests on a dark wood base. On top of the cap is the Chinese symbol for water. Viewed as a whole, the bottle reminds one of a perfect drop of water.The box is a pale blue with the Chinese water symbol on the top panel.This fragrance would certainly be appropriate for day or evening.", "overall": 4.0, "summary": "DISTINCTLY FEMININE", "unixReviewTime": 1109635200, "reviewTime": "03 1, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000C1Z29Q", "reviewerName": "Gail Cooke", "helpful": [2, 4], "reviewText": "What is it they say about love? A better question might be what don't they say about love? It makes the world go round. What the world needs now is more of it. It's a many splendored thing. A moments madness. The list goes on and on. .Little wonder it's also the inspiration for a bold, seductive new fragrance from Cacharel.It arrives in a brilliant red bottle, the color of a heart, the shade of passion. Amor Amor is both romantic and vivacious with top notes of pink grapefruit, blood orange, sweet mandarin and black currant. Heart notes are found in apricot, red rose, jasmine melati flower and lily of the valley.Available in 1 oz, 1.7 oz. and 3.4 oz. sprays, it promises to be a highly coveted fragrance at an affordable price.", "overall": 5.0, "summary": "LOVE, LOVE, HOORAY FOR LOVE !", "unixReviewTime": 1132617600, "reviewTime": "11 22, 2005"},
{"reviewerID": "A2W4UPPE8RUT6Z", "asin": "B000C1ZDTU", "reviewerName": "ElaineReads \"ElaineReads\"", "helpful": [5, 11], "reviewText": "After hearing Oprah's rave reviews of this perfume, and seeing that it was one of her Favorite Things for 2005, I thought for sure I'd love it.  I ran right out to the nearest department store for a sample of it!  I just had to see for myself...Well, I was NOT impressed.  The scent is so strong and overwhelming that it actually seemed to \"catch\" in my throat.  I accidentally got some on my hand and after four hand washings I could still smell it.  I guess, for those of you who like this perfume, that's probably a good thing.Anyway, I think this perfume is too \"old lady\" for my taste.  It reminded me of J. Lo's Glow.  Which I also have and don't like.For comparisons sake, perfumes I do like are Britney Spears' Curious, Clinique Happy, Escada Island Kiss and Lucky You.", "overall": 1.0, "summary": "Not impressed at all...", "unixReviewTime": 1133136000, "reviewTime": "11 28, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000C1ZDTU", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [7, 11], "reviewText": "Lovely by Sarah Jessica Parker features breezy top notes of honeysuckle. And crisp middle notes of sunny tangerine with sweet base notes of juicy mango guava. Lovely is exciting blend with top notes of passion fruit and light middle notes of pink freesia. Leaving you with sweet base notes of blackberry.How can anyone NOT love this perfume is all I'm wondering?!?!?!", "overall": 5.0, "summary": "Whether you enjoy lazy days at the beach or wild nights in the urban jungle, you'll love this exciting fragrance.", "unixReviewTime": 1131926400, "reviewTime": "11 14, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000C211H2", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [6, 8], "reviewText": "Love this scent. Definately not too strong and it seems to last quite a while. Perfect for everyday wear. It has a strong undertone of vanilla so if that's not your bag I wouldn't recommend it.", "overall": 5.0, "summary": "Oh yea! Heaven, I'm in Heaven!!", "unixReviewTime": 1120521600, "reviewTime": "07 5, 2005"},
{"reviewerID": "A1RHVEZJA30HGW", "asin": "B000C21BT0", "reviewerName": "Veronica Lake \"Missy\"", "helpful": [0, 1], "reviewText": "I absolutely love this perfume! It smells great, and it tastes sweet. It doesn't last all day, but I don't know of any perfume that does. I also purchased the lip glosses, and like them alot too.", "overall": 5.0, "summary": "Gimme gimmie gimmie!!!!", "unixReviewTime": 1120867200, "reviewTime": "07 9, 2005"},
{"reviewerID": "A1BHCE2409B5QF", "asin": "B000C21BT0", "reviewerName": "Victoria", "helpful": [2, 4], "reviewText": "Best way to describe it-somewhat sweet but sharp at the same time. Very potent. I sprayed a little on my wrist and my husband could smell it few feet away. Unfortunately, I didn't care for it-I think its a bit too strong for my taste.", "overall": 3.0, "summary": "Matter of taste", "unixReviewTime": 1120262400, "reviewTime": "07 2, 2005"},
{"reviewerID": "AKMEY1BSHSDG7", "asin": "B000CPIMNA", "reviewerName": "J. Arena", "helpful": [3, 3], "reviewText": "Loreal Natures Therapy Mega Moisture Creme performs extremely well. My hair is color treated, curly and very long. This conditioner gets rid of the worst tangles, so that a wide-tooth comb just glides through. Amazing! It is very concentrated, and the jar lasts a long time. If you leave it on your hair for several minutes and let it really soak in, you can use a lighter conditioner in-between treatments.", "overall": 5.0, "summary": "Smoothes the wildest mane!", "unixReviewTime": 1133654400, "reviewTime": "12 4, 2005"},
{"reviewerID": "A231FGX8G2Q5EW", "asin": "B000CRGS2A", "reviewerName": "4EverYoung", "helpful": [131, 136], "reviewText": "I have been using this product for a few weeks now, one to two times a day as the instructions states. A small amount is needed per eye (about the size of a small pea). Well the puffiness is not as severe, although a nice cold pack mask left of the face in the morning for about 5-8 minutes will do the same job for about $10.00, and it's re-usable. As for the reduced dark circles... well there is a slight (and I do mean slight) noticeable difference in the shade. I would imagine it would take a few months and about 3-4 tubes @ $100 a piece to possibly see a truly noticeable difference. Now mind you I do not have raccoon eyes, as does the lovely model who wears the shoe polish so eloquently & proudly displays. I do however, have a darker and more noticeable shade than most, giving the illusion I haven't gotten a good nights rest in a few days.. (that is to say if one is really paying close attention to this other than myself. Once I finish the current tube I am on, I will then determine if further treatment is necessary if my vanity continues to get in the way.", "overall": 3.0, "summary": "That's Mr Raccoon Eyes to you!.....", "unixReviewTime": 1119571200, "reviewTime": "06 24, 2005"},
{"reviewerID": "A3PEOF0GX4EN38", "asin": "B000CRGS2A", "reviewerName": "Carolyn Rampone \"Carolyn D'Amico Rampone\"", "helpful": [80, 80], "reviewText": "The advertising for this so called miracle cure should have been the first red flag but somehow I believed this just might work.  It doesn't and it angers me to know I fell for the hype.  The packaging looks so professional and the cost was high enough that it gave the impression of a valuable product.  It isn't.  I am Italian and Greek and there isn't anything that will erase heredity and that is what most dark under eye circles are caused by.  If yours are from lack of sleep, get more sleep.  It they're from allergies, take Claritin but don't throw away $100.00 plus  on this tube of nothing.  It is not worth the money and can't do what is promised.  Please, just judge this product by the advertising picture.  It looks as if someone used black paint under the eyes of the model and then the after picture is perfect and they insinuate their product made the difference.The company that markets this useless cream is called \"Basic Research.\"  Let that be a lesson to all of us, do some basic research first, before throwing away money on garbage.  Macy's and Amazon should immediately pull this item.  To do less would ruin the credibility of both companies, currently held in high regardUPDATE: I was able to get a refund through my local Macy's.  This isn't mentioned in the ad but the clerk there told me I wasn't the first to ask for my money back and I am sure,  won't be the last. The fact they took it back locally speaks volumes.Bottom line...save your money and don't fall for this one..it just doesn't work!!", "overall": 1.0, "summary": "No stars!  A major RIP-OFF!!!", "unixReviewTime": 1122163200, "reviewTime": "07 24, 2005"},
{"reviewerID": "AFDPEDMUL0J54", "asin": "B000CRGS2A", "reviewerName": "Pat", "helpful": [0, 0], "reviewText": "After 8 weeks of consistent use, I see no change. My dark circles are a family trait, and I emailed the company before purchase to ask if it worked for inherited dark circles. The respondent assured me it worked for ANY dark circles.", "overall": 1.0, "summary": "I'm embarassed to say that I fell for the hype, too.", "unixReviewTime": 1130371200, "reviewTime": "10 27, 2005"},
{"reviewerID": "A1P4F6HIXU6WYE", "asin": "B000F0GNT2", "reviewerName": "Lee Mellott \"Work at Home Author\"", "helpful": [44, 47], "reviewText": "At first I was hesitant to ante up the $ to purchase the dermanew system, but after a few friends raved about it, I decided to buy it.The system includes a battery operated applicator tool (batteries are included), sponge tops for the tool, and dermabrasion cream.You pop a sponge on top of the applicator, put cream on it and apply to your dampened skin. I set a timer for 3 minutes and work the applicator around the surface of my skin.The results are great! Dead skin is sloughed off, circulation is stimulated and the results are glowing soft skin.My skin looks lovely and feels smooth to the touch. It felt soft and wonderful after the very first application!Dermanew sells other applicator sponges and creams separately to use with the applicator tool on your hands and feet.Though the initial price tag seems high, this tool will last for years and help you to glowing skin! I highly recommend it.", "overall": 5.0, "summary": "Lovely soft skin can be yours!", "unixReviewTime": 1108684800, "reviewTime": "02 18, 2005"},
{"reviewerID": "AYPIF2S8P3RZT", "asin": "B000F8JUJY", "reviewerName": "Vyshtia", "helpful": [25, 91], "reviewText": "This is a Stainless Steel Bar designed to remove odors from your hands.  Stubborn odors like garlic and onions may be stubborn and hard to remove, but rub your hands on this Bar and the odors will be gone.Does it work?  Yes.Do you need it?  No.Why?  Because rubbing your hands on anything stainless steel will accomplish the same thing and there should be plenty of stainless steel items you can get your hands on.No?  You don't?  Then you prolly do have a need for this item!", "overall": 1.0, "summary": "You do not need this item.", "unixReviewTime": 1133568000, "reviewTime": "12 3, 2005"},
{"reviewerID": "A19ZE9E4C1L3IY", "asin": "B000FBK5IQ", "reviewerName": "T. Sullivan \"Juicy Couture Lover!\"", "helpful": [8, 10], "reviewText": "I bought this because i have very fair skin, and thought it would be the perfect blush & skin brightener...it did not work. Again, I am blonde and ivory skin and you cannot see this at all unless you pile it on, then whats the point? It just looks like you have on a ton of makeup.I was not imprssed...", "overall": 3.0, "summary": "not what you expect...", "unixReviewTime": 1126828800, "reviewTime": "09 16, 2005"},
{"reviewerID": "A2W10YRC8CWAD7", "asin": "B000FFT8KS", "reviewerName": "Amazon Customer \"the undersigned\"", "helpful": [3, 5], "reviewText": "Cetaphil Gentle Skin Cleanser is the gentlest facial cleanser I have been able to find. I am highly allergic to several different soaps and preservatives, but Cetaphil doesn't cause me to break out, itch, or dry up.I'd suggest the liquid Cetaphil cleanser instead of their soap bar, as bars can cause one to have clogged pours (read: blackheads).The only downside is that it won't remove makeup very easily, so I only use it in the morning and use my trusty cold cream at night.", "overall": 5.0, "summary": "Awesome cleanser for sensitive skin", "unixReviewTime": 1113264000, "reviewTime": "04 12, 2005"},
{"reviewerID": "A1SYLII0808HD6", "asin": "B000FGDIAS", "reviewerName": "M. Allen Greenbaum", "helpful": [3, 13], "reviewText": "When I first read the manufacturer's description of this product, it was so hyped up that it seemed like snake oil revisited.  It touted the ions that refreshed the air--a property of the natural citrus oil, not some special ionization technique. Recommended uses included deodorizing diaper pails--a task that this light freshener is probably not up to. The bottle still claims that the product is:\"Useful in the Art and Science of Feng Shui.\" (Which part of spraying the container is art, and which science, I wonder.]\"Restores Balance, Joy, and Harmony.\"It also claims to \"Purify, Freshen, and Protect\" (Purify...Protect?!)Here's what it does:One or two sprays away from your face emit a pleasant orange scent, which will awaken your senses when your unventilated office threatens to lull you to a stupor.  I suppose one could open a window instead, but sometimes there either are no windows, or the outside is noisy and/or has its own unpleasant odors.Here are the features I like about this product:1. Non-aerosol delivery--no flourocarbons.2. Up to 2,000 sprays from the 4.6 ounce container.3. Made of pure essential oils distilled from real citrus peels (but are they oranges?), with nothing else added.4. A nice scent that is not overpowering.5. Not tested on animals.6. Portable.A good product, although you might want to try the somewhat more expensive liquid natural extracts available.  These come in more scents and blends, and can be used in perfumes, colognes, etc.  As for Feng Shui, get a book from Amazon.com to learn the many components above and beyond the extracted scent of a citrus peel.", "overall": 4.0, "summary": "A Reduction in  Hyperbole", "unixReviewTime": 1107129600, "reviewTime": "01 31, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000GNUUCO", "reviewerName": "Gail Cooke", "helpful": [3, 5], "reviewText": "Who's been described as \"Bold. Glamorous. Full Frontal Sexy\"? Kimora Lee Simmons, of course. She's also an uber-babe who has turned the once dull tiny T-shirt Baby Phat line into a very contemporary array of styles worn by the hip and hope-to-be. Now, has introduced her first fragrance, an extension of the Baby Phat line, called Baby Phat Goddess.As unique as the woman herself, Baby Phat Goddess is a rich floral bouquet with op notes of pure gardenia, white rosebuds and cedrat flower. Now, what's sweet without sophistication? For that, there's a tad of black pepper.You know the bottle has to be something special, and it is - faceted and modeled after her rare Asscher cut diamond, complete with a faux diamond ring around the neck of the bottle.An impressive gift, although definitely not for Auntie Em.", "overall": 5.0, "summary": "definitely not for auntie em", "unixReviewTime": 1129939200, "reviewTime": "10 22, 2005"},
{"reviewerID": "A356TJCTCLDN89", "asin": "B000GNUUCO", "reviewerName": "Kimberley Wilson", "helpful": [3, 3], "reviewText": "Yeah, the bottle is a bit over the top but this Baby Phat not Nina Ricci, okay? The scent is the important thing and it's wonderful. This is light enough for work and memorable enough for the evening. I bought it on impulse and it's become a favorite.", "overall": 5.0, "summary": "Exquisite!", "unixReviewTime": 1129420800, "reviewTime": "10 16, 2005"},
{"reviewerID": "AIIR8E34EDKCQ", "asin": "B000JL69OG", "reviewerName": "- Kasia S.", "helpful": [5, 26], "reviewText": "I was warned by friends before that this smelled really bad, well I sprayed my whole hand with it anyway. The bottle is pretty, the gray ribbon tester is pretty, Sarah is pretty too but the scent is horrendous.It smells like some lovely old moth eatten socks under dust bunny attack.Im a fan of Sarah Jessica, but the perfume is totally off for me. I love floral and woody tones, but this just smells like dirt.", "overall": 2.0, "summary": "Blech", "unixReviewTime": 1130803200, "reviewTime": "11 1, 2005"},
{"reviewerID": "A1DRM3JV6T5O6P", "asin": "B000JVY52Y", "reviewerName": "Phillip Oliver", "helpful": [0, 0], "reviewText": "The particles are very small so this is more like a body wash rather than a scrub. It is very refreshing though and I enjoyed using it. It has a nice citrus-like smell and the cobalt blue color is rather unique. Very pricey though - not sure if I would purchase it again.", "overall": 3.0, "summary": "More like a body wash than a scrub", "unixReviewTime": 1119830400, "reviewTime": "06 27, 2005"},
{"reviewerID": "ASGIVOW34XNQS", "asin": "B000KFVY46", "reviewerName": "sparky_magic_rainbow", "helpful": [1, 2], "reviewText": "This is by far one of the best exfoliants I have ever used. It is less abrasive than St. Ives Apricot and Burts Bees scrubs because the grains are smaller. IMHO this scrub is better quality than expensive department store brands like Estee Lauder or Roc because it smells and feels completely natural.Earth Therapeutics makes high quality products at reasonable prices. I've been trying to find their \"Strawberries and Cream\" soap (another favorite) without luck.", "overall": 5.0, "summary": "gentle and effective", "unixReviewTime": 1117756800, "reviewTime": "06 3, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B000P250NK", "reviewerName": "Gail Cooke", "helpful": [2, 3], "reviewText": "Following on the heels of his lovely women's perfume, Shi, and his successful men's fragrance, Hie, noted designer Alfred Sung has introduced Jewel.  What first catches your eye is the bottle - it's a crystal.  Each one is different, unique with light reflected in the various facets.  The spray cap is found on the bottom, thus the bottle looks very much like its name - a jewel.Topped by white floral and fruit notes, the scent is full-bodied, fresh; the word radiant comes to mind.  Other notes include Night Blooming Jasmine, Orange Flower, Frangipani Petals with touches of Coconut Milk and Plum.Jewel is also available in Body Lotion and Hand Cream.  Enjoy!- Gail Cooke", "overall": 5.0, "summary": "INCREDIBLY BEAUTIFUL", "unixReviewTime": 1134172800, "reviewTime": "12 10, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B000QUJ0IC", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [3, 3], "reviewText": "If you have used a variety of makeup removers, you will appreciate these refreshing pre-moistened pads. There is absolutely no oily residue to worry about because they are oil free. They even remove waterproof mascara.Each pad is a high quality woven material that won't fall apart like a pressed cotton round. There are no \"fuzzies\" to get into your eyes and the formula is safe for Contact Lens Wearers. I also love using these make-up removers when I'm not wearing makeup. They refresh your skin with Aloe Vera and then you can use some JASON 98% Aloe Vera Super Gel to maintain the cooling feeling. Perfect in the dryness of winter or the heat of summer. If you keep the container in the refrigerator, they are even more refreshing.These are perfect for travel because you don't have to worry about bottles spilling and they are a convenient way to cleanse the skin when you are not near a sink.Ingredients: Purified Soft Water, Certified Organic Extracts of Euphrasia Officinalis (eye-brite), Aloe Barbadensis (Aloe Vera), Anthemis Nobilis (chamomile), Symphytum Officinale (comfrey), Cucumis Sativus (cucumber), Allantoin, Tocopherol (natural vitamin E), Panthenol (vitamin B), L-Ascorbic Acid (vitamin C), Sphingolipids, Steareth 20, Cocaminopropylbetain, Methylparaben, Propylparaben.Fragrance FreeNot Tested on Animals\"Quick Clean Make-Up Removers\" feel pure and natural and they leave your skin feeling refreshed and completely cleansed.Also look for:JASON Ester-C LotionHyper-C SerumVitamin E Hand & Body LotionSea Fresh Natural ToothpasteApricot Satin Shower Body WashShaman Earthy Organics Shampoos, Conditioners and Body LotionsHeather's Natural & Organic Cleaning ProductsThese are some recent \"JASON\" product finds that I love!~The Rebecca Review", "overall": 5.0, "summary": "Perfect Makeup Remover Pads", "unixReviewTime": 1130630400, "reviewTime": "10 30, 2005"},
{"reviewerID": "A1IIECPU2GF17U", "asin": "B000ZMBSPE", "reviewerName": "gilroygal \"gilroygal\"", "helpful": [53, 80], "reviewText": "I have been using this for about a week. I mix it with apple cider vinegar, and already my pimples have shrunk, and when I use the mask, the blackheads squeeze out and rinse away. I highly recommend this for anyone who has been a long time acne sufferer!!", "overall": 5.0, "summary": "I LOVE this stuff!!", "unixReviewTime": 1135209600, "reviewTime": "12 22, 2005"},
{"reviewerID": "A11C2ZX984GQW6", "asin": "B0012TCFBA", "reviewerName": "Those Darn Donkeys!", "helpful": [226, 244], "reviewText": "La Mer should, at least initially, be purchased from a trained salesperson. There is alot of fol-de-rol with this line, and you will need assistance selecting the right product and coaching in how to use it.If you buy it from a large enough retailer of the product (Nordstrom at South Coast Plaza, for example), you will be invited to special workshops. And any retail sales person will put you on their list and call you when there are gifts-with-purchase.I use this line, but I also use others. My only qualm with this one is that the Creme is made with mineral oil, which I personally find is not helpful to skin. (Think about it, it's a petroleum product.) This is one reason it must be \"liquified\" in the palm of your hand. And not a little, a lot.You have to be willing to suspend your disbelief and accept the product's \"miracle\" properties that cannot be described by science. For the analytical person, there will be greater faith in lines that are continually researching, advancing their science, and doing clinical studies. For general, versus \"targeted\" skin care, this is a very good line.This line requires patience and practice. If you are a slap-dash person or someone who has to rush out the door in the morning, this is probably not the line for you.This line is geared to Women and Men of a Certain Age (and with a certain pocketbook) and more youthful skins may find other skin care products more to their needs.", "overall": 4.0, "summary": "La Mer Products in General", "unixReviewTime": 1115337600, "reviewTime": "05 6, 2005"},
{"reviewerID": "A3FHDBBXZFNQUK", "asin": "B00152W1YU", "reviewerName": "JK8", "helpful": [9, 10], "reviewText": "Shalimar is an old scent but not old fashioned.  It is a heavy fragrance that will still linger on your bedsheets the next morning.  Very oriental, vanilla and sandalwood accents give me a very good feeling about myself.  I feel more beautiful.  Do not apply after shaving as the fragrance will burn raw skin.", "overall": 5.0, "summary": "My favorite from the house of Guerlain", "unixReviewTime": 1132790400, "reviewTime": "11 24, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B0016O94IS", "reviewerName": "Gail Cooke", "helpful": [6, 6], "reviewText": "Yep, oil is definitely for salads 0r crankcases and \"The Shining\" should refer to a scary novel by Stephen King.  If your  proboscis is anything like mine and has the power to penetrate foundation due to an excess of oiliness, Enzymion is a must-have.Since I have combination skin, it's best for me to use Enzymion only in the oily area which is, of course, smack dab in the middle of my face.  Whether I'm wearing makeup or not this friendly blend of papaya and aloe vera makes excess oil disappear while leaving skin soft, supple, and clear.Enzymion is  major help in keeping a shine on my shoes and not on my nose.", "overall": 5.0, "summary": "OIL IS FOR SALADS", "unixReviewTime": 1118707200, "reviewTime": "06 14, 2005"},
{"reviewerID": "AWBGHDHH7E51F", "asin": "B00178TVXG", "reviewerName": "Trend \"jewelry nut\"", "helpful": [170, 175], "reviewText": "Someone suggested I use this product.  After a year of wearing acrylic nails,  my own nails were very weak, peeling, worn VERY thin and red.  I was actually embarrased to go from beautiful false nails to my own nails that had been severely weakened.  I tried this product. I followed the instructions to the letter. Within 2 months my short, damaged nails were long and very strong and healthy.  It was amazing. The beauty of this product is your nails become stronger. With regular use, your actual nails, without any polish, becomes strong.  I didn't change my diet. I didn't eat gelatin. The only thing I did was use this product as directed. Don't be put off by the price.  It is worth every penny.  Until now, I've never had long natural nails.  Even before they were severely damaged, they broke before they grew much length.  Thanks to this Nail Envy, I have acrylic looking nails, that are my own.", "overall": 5.0, "summary": "GREAT PRODUCT", "unixReviewTime": 1127433600, "reviewTime": "09 23, 2005"},
{"reviewerID": "A2MNUZHMGVN5G2", "asin": "B001AWDWWA", "reviewerName": "ARA", "helpful": [24, 26], "reviewText": "I LOVE this conditioner!!!!!  You do have to leave it on for longer than most conditioners, but it's worth it!  I like the smell (although it's pretty much undetectable after your hair is dry), and it really leaves my hair soft, shiny, & silky.  It also feels nice on my scalp.  I use this usually at least once a week--I alternate with other Aubrey conditioners depening on my mood (& amount of time I have).  Aubrey Organics is a fabulous company who has made a fabulous, truly all-natural conditioner!!!!!", "overall": 5.0, "summary": "Excellent conditioner!!!!", "unixReviewTime": 1107043200, "reviewTime": "01 30, 2005"},
{"reviewerID": "A2MNUZHMGVN5G2", "asin": "B001AWL010", "reviewerName": "ARA", "helpful": [2, 7], "reviewText": "Even though this is a very small bottle, it does last for a long time (at least several months--you could probably buy just 2 per year).  It is very moisturizing and feels nice on your skin.  As far as I could tell, it did seem to make my skin feel smoother--at least while it was on.  I'm not sure how well it worked on any wrinkles, but then again, I don't really have many yet.  I liked it enough to buy another bottle if I get a good deal on it, but I'm not planning on buying another otherwise.  I gave it 3 stars because about all it did for me was moisturizing, but I'm not a very good candidate for it's efficacy on wrinkles since I don't really have more than very fine lines.  I've read other reviews on it where people were amazed how well it worked.  I think if you have really dry skin it'd be quite helpful (again, I also don't have very dry skin, so it's not as helpful to me).  I have tried many other Aubrey Organics products, and so far they've all been fabulous.", "overall": 3.0, "summary": "Very moisturizing & lasts a long time", "unixReviewTime": 1107043200, "reviewTime": "01 30, 2005"},
{"reviewerID": "A1F9Z42CFF9IAY", "asin": "B001CJJ5QS", "reviewerName": "T. Tom", "helpful": [28, 31], "reviewText": "While most sunscreens these days protect against sunburn, did you know that very few of them actually protect against photodamage? Only two sunscreen ingredients protect against the long UVAI rays that cause photodamage (brown spots, wrinkles, etc); zinc oxide and Parsol 1789. Zinc Oxide protects a broader range of these rays than does Parsol 1789.This Skinceuticals sunscreen has zinc oxide and it goes on without any white film or greasiness-perfect for daily use on the face. While Neutrogena Dry Touch suncreens feel more invisible on the skin (you can't even tell it is on except for the smell) and is a good alternative (has Parsol 1789), I still prefer the Skinceuticals for the added protection and virtually no scent whatsoever. Since it's expensive, I tend to use it just on the face and use a cheaper (like Neutrogena) sunscreen on the body when out in the sun.", "overall": 4.0, "summary": "Great sunscreen although a bit expensive", "unixReviewTime": 1117670400, "reviewTime": "06 2, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B001E6TDYS", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [12, 16], "reviewText": "If you love mixing up your own masks, this is one product that makes home spa time really fun. This is easy to apply whileyou are in the bath or before you jump into the shower.Burt's Bees produces products that are healing for the skin, there is also a calming, emotional element that makes you feel loved and nurtured by nature itself. The scent of Eucalyptus has always been calming to me and this product contains the oil.Ingredients (they have changed the ingredients to make it work even better than before): French green clay, bentonite, fragrance, peppermint leaf, shavegrass herb, calendula, rosemary leaf and sage.This mask is a lovely avocado green and will make you feel more calm. I loved how the powder can also be mixed with my favorite moisture mask or with natural ingredients for variety.I've rarely seen a product clean pores this well. You can simply pour some of the green powder into your hand and mix in a little water. After applying, let dry and then rinse.It dries super fast and is perfect to cleanse and heal the skin.If you love this product, also look for the Queen Bee kit with sample sizes of luxurious products.~The Rebecca Review", "overall": 5.0, "summary": "Superior Pore Cleansing and Refining", "unixReviewTime": 1133308800, "reviewTime": "11 30, 2005"},
{"reviewerID": "A1P4F6HIXU6WYE", "asin": "B001UHN0HM", "reviewerName": "Lee Mellott \"Work at Home Author\"", "helpful": [122, 123], "reviewText": "My husband recently asked me what the hairdresser did to make my hair look so sleek when she styled it. I used the same products as her and copied her techniques but my fine hair tended to be a bit frizzy. The next time I was at the hairdressers I paid closer attention. Same shampoo, conditioner, brush size and similar technique. As she blew my hair dry I realized the difference - she used a professional hair dryer.  For years I have purchased inexpensive drugstore hairdryers that run about $20 and replaced them when they blew a fuse a year or so later. With a professional dryer she was able to dry my hair quicker and that combined with ceramic and ionic technology of the dryer she used cut out the frizzys!After checking out several hair dryers including the one she used, I decided on the Babyliss Pro-Carrera. There were a number of reasons. It offers ceramic and ionic technology. The wattage 1900 is gentler than the 2000 but still powerful. AND a super selling point was that though the dryer is a professional model it is LIGHTER and more COMPACT than other professional dryers by about 25%. Yes I want nice toned arms but not from using a hairdryer. I wanted the dryer to be easy to maneuver.The dryer has not disappointed. The styling is very euro-chic. Black with a matte finish. Not the shiny easily scratched surface of other models. Controls are easy to use. The handle is comfortable to hold. It has a heavy duty cord, overkill for my home perhaps but not a problem and the hairdryer is compact and not too heavy. The dryer comes with a concentrator nozzle which is not mentioned in the item description. This snaps on the dryer and concentrates the air where you want it to go.And it dries beautifully. A powerhouse but very controlled - works great on my baby fine hair and dries my daughters thick locks in half the time of our cheapie models. And the good news is I understand it will last for years instead of breaking down within a short time period like the cheapie models. Plus its quiet!Sleek styling, good looks and great results - a super hairdryer choice!", "overall": 5.0, "summary": "Shiny, sleek bouncy locks can be yours!", "unixReviewTime": 1107216000, "reviewTime": "02 1, 2005"},
{"reviewerID": "ASGIVOW34XNQS", "asin": "B002DMK0KS", "reviewerName": "sparky_magic_rainbow", "helpful": [8, 12], "reviewText": "One of the first telltale signs of aging is tired or puffy eyes. So I use this cream ... and look a little younger :)This eye cream is very very rich and works best at night. I sometimes use it during the day time though. It stays on for 3 to 4 hours and really does diminish fine lines. I've tried more expensive department store brands, but they are too watery to be effective moisturizers. I have used Royal Jelly for a few years and pray they will never discontinue.", "overall": 5.0, "summary": "MIRACLE PRODUCT MAKES ME LOOK YOUNGER", "unixReviewTime": 1128384000, "reviewTime": "10 4, 2005"},
{"reviewerID": "A281NPSIMI1C2R", "asin": "B002DPUXZ2", "reviewerName": "Rebecca of Amazon \"The Rebecca Review\"", "helpful": [2, 5], "reviewText": "If you are looking for a toner with rosewater, Burt's Bees makes one of the most calming toners.Ingredients: Rosewater, SD alcohol 40-B (from yellow corn), vegetable glycerin, cornflower extract, aloe barbadensis leaf extract, witch hazel extract, yucca extract.If you love this product, you might want to try the Burt's Bees Pore-Refining Mask with Green French Clay: one of the best masks for cleaning your pores and tightening the skin. I've never seen anything work that well before! I think it is the blend of flower powders and eucalyptus oil.Also recommended:Marshmallow Vanishing CremeRoyal Jelly Eye CremeEvening Primrose Overnight CremeParsley Blemish StickShea Butter Decollete Creme~The Rebecca Review", "overall": 5.0, "summary": "Rosewater Toner", "unixReviewTime": 1133568000, "reviewTime": "12 3, 2005"},
{"reviewerID": "A2DCS7ORDHO1RQ", "asin": "B002NMI4AG", "reviewerName": "Pookerella \"RN\"", "helpful": [117, 122], "reviewText": "But I have to admit, I didn't care for this product. Recently, I have used1. bumble + bumble2. Pssssst!3. Algemarin dry shampoo4. KloraneKlorane is my least favorite. I don't like the way it makes your hair feel. With Pssssst! and the Algemarin, your hair feels soft and not greasy. This stuff makes it feel kind of dry and stiff and not really clean. Smell is OK. Pick the Algemarin; nice smell. Sadly, Pssssst! no longer has a scent. They decided to release the unscented version,. Algemarin is more like pssssst and doesn't leave a lot of white stuff in your hair. I think the particles on the Klorane are bigger, therefore they not only show more, but don't really do the job as well as they could.P.S. there is a technique to using dry shampoo and if you are anything but grey haired or blonde, you need to follow the \"rules.\" First, never spray it on hair that will be the outer hairs of your \"do\" meaning don't spray it where you plan to part your hair. Spray it just underneath it. Second after spraying, take a towel and towel rub it through your hair. Then take a soft BRISTLE brush and brush your hair till all the white is gone and it looks more normal. Wipe off any remaining \"white\" residue with a damp washcloth. Style as usual!", "overall": 2.0, "summary": "It's OK", "unixReviewTime": 1129680000, "reviewTime": "10 19, 2005"},
{"reviewerID": "A3M174IC0VXOS2", "asin": "B0030GFXMQ", "reviewerName": "Gail Cooke", "helpful": [1, 1], "reviewText": "Southwest sun can take its baking toll on hair unless you're wise and usually wear a hat. (I'm not wise and I don't really care for hats. Every once in a while there's an errant breeze during the summer months, and it feels good touching and lifting your hair) Now, I've accepted the blame for often dry lackadaisical locks, what's the solution?For me, Fekkai's Glossing Cream with its addition of pure olive oil delivers shine, hydration and manageability. It comes in the trademark Fekkai tube (easy to squeeze with wet hands).Since my hair is fine and fly-away it works best for me if I rub a small amount between my palms on towel dried hair and stroke through. Then I repeat the process after blow drying and before styling.It's incredibly light yet effective.  Fekkai is simply the finest!", "overall": 5.0, "summary": "A HOUSE CALL FOR HAIR", "unixReviewTime": 1130544000, "reviewTime": "10 29, 2005"}]
